"""Задача 1. Драка
Что нужно сделать
Вы работаете в команде разработчиков мобильной игры, и вам досталась часть от ТЗ заказчика.

Есть два воина. Каждому устанавливается здоровье в 100 очков. Они бьют друг друга в
случайном порядке. Тот, кто бьёт, здоровье не теряет. У того, кого бьют, оно уменьшается на 20 очков от одного удара.
После каждого удара надо выводить сообщение, какой воин атаковал и сколько у противника осталось здоровья. Как только
у кого-то заканчивается ресурс здоровья, программа завершается сообщением о том, кто одержал победу.

Реализуйте такую программу."""

print("Мое решение")
import random
class Warrior:
    def __init__(self):
        self.point = 100

    def battle():
        while warrior[0].point > 0 and warrior[1].point > 0:
            battle_num = random.randint(0, 1)
            print(f'Атакует воин {battle_num + 1}', end=' ')
            if battle_num == 0:
                warrior[1].point -= 20
                print(f'у воина 2 осталось {warrior[1].point}')

            else:
                warrior[0].point -= 20
                print(f'у воина 1 осталось {warrior[0].point}')

        print(f'\nПобедил воин {battle_num + 1}')

warrior = []
for index in range(1, 3):
    warrior.append(Warrior())
Warrior.battle()

