# Задача 2. Финансовый отчёт
# Что нужно сделать
# Наде дали задание сформировать финансовый отчёт за последние 20 лет по полугодиям. Нужно сумму дохода первых двух кварталов поделить на сумму
# последних двух кварталов, чтобы понять динамику роста или падения дохода. И так за каждый год. Надя решила, что быстрее будет написать простую программу, которая
# сделает всё за неё.
# Запросите у пользователя четыре числа.
# Отдельно сложите два первых и отдельно — два вторых.
# Разделите первую сумму на вторую.
# Выведите результат на экран.

num_1 = int(input("Введите число № 1: "))
num_2 = int(input("Введите число № 2: "))
num_3 = int(input("Введите число № 3: "))
num_4 = int(input("Введите число № 4: "))
res_1 = num_1 + num_2
res_2 = num_3 + num_4
res_3 = res_1 / res_2
print(res_3)