# Что нужно сделать
# Напишите программу, которая получает от пользователя число и выводит на экран два ответа — следующее и предыдущее числа. Результат:
# Что оценивается
# input содержит корректное приглашение для ввода;
# вывод соответствует заданию;
# нет простых print(a), print(a - 1);
# пробелы после запятых в print.
num_1 = int(input("Введите число: "))
print(f"После числа {num_1} идет число {num_1 + 1}")
print(f"До числа {num_1} идет число {num_1 -1}")