# Задача 4. Площадь треугольника
# Что нужно сделать
# Напишите программу, которая запрашивает у пользователя длины двух катетов
# в прямоугольном треугольнике и выводит его площадь.
# Советы и рекомендации
# Не стоит применять целочисленное деление, это не совсем корректно.
# Обратите внимание на написание переменной S: её нужно писать s — со строчной.
# Что оценивается...
# корректность вычислений и применения правильных операций;
# input содержит корректное приглашение для ввода;
a = int(input("Введите длину катета а: "))
b = int(input("Введите длину катета b: "))
print(f"Площадь треугольника равна { (a * b) / 2}")