# Задача 5. Часы
# Что нужно сделать
# Напишите программу, которая получает на вход число n (количество минут), затем считает, сколько это будет в часах и сколько минут останется,
# и выводит на экран эти два результата.
# Что оценивается
# результат вычислений корректен;
# input содержит корректное приглашение для ввода;
# переменные имеют значащие названия;
# пробелы после запятых, пробелы при бинарных операциях.
n = int(input("Введите кол-во минут: "))
print(f"Это будет {n // 60} часов и { n % 60} минут.")
