# Задача 8. «Режем» число на части
# Что нужно сделать
# Реализуйте программу, которая получает на вход четырёхзначное число и выводит на экран каждую его цифру отдельно (в одну
# строчку либо каждую цифру в новой строчке). Само число при этом изменять нельзя, то есть нужно обойтись без переприсваивания.
# Однако можно использовать сколько угодно переменных.
# Что оценивается
# результат вычислений корректен;
# Input содержит корректное приглашение для ввода;
# пробелы после запятых, пробелы при бинарных операциях.
num_1  = int(input("Введите четырех значноечисло: "))
a = num_1 // 1000
b = (num_1 - (a * 1000)) // 100
c = (num_1 - (a * 1000) - (b * 100)) // 10
d = num_1 - (a * 1000) - (b * 100) - (c * 10)
print(a, b, c, d)
print(a)
print(b)
print(c)
print(d)


