# Задача 9. В обратном порядке
# Что нужно сделать
# Реализуйте программу, которая получает на вход четырёхзначное число и выводит его на экран в обратном порядке. Само число при
# том изменять нельзя, то есть нужно обойтись без переприсваивания. Однако можно использовать сколько угодно переменных.
# Пример ввода: 1234. Пример вывода: 4321.
# Что оценивается...
# результат вычислений корректен;
# input содержит корректное приглашение для ввода;
# пробелы после запятых, пробелы при бинарных операциях.
num_1  = int(input("Введите четырех значноечисло: "))
a = num_1 // 1000
b = (num_1 - (a * 1000)) // 100
c = (num_1 - (a * 1000) - (b * 100)) // 10
d = num_1 - (a * 1000) - (b * 100) - (c * 10)
print(f"Число наоборот: {d * 1000 + c * 100 + b * 10 + a}")

