# Есть картошка со следующими характеристиками:
# 1. Номер картошки в грядке (индекс)
# 2. Стадия зрелости (стадии: отсутствует, росток, зеленая, зрелая)\

# Картошка может:
# 1. Расти (переходить на следующею стадию созревания)
# 2. Предоставлять информацию о своей зрелости.

# Есть грядка с картошкой, которая:
# 1. Содержит список картошки, которая на ней растет

# И может
# 1. Взращивать картошку
# 2. Предоставлять информацию о зрелости всей картошки.

import garden

my_garden = garden.PotatoGarden(5)
my_garden.are_all_ripe()

for _ in range(3):
    my_garden.grow_all()
    my_garden.are_all_ripe()