# region Основы работы с модулем pyplot
import matplotlib.pyplot as plt     # Импорт модуля.
# -------------------------------------------------------------------------------------------------------------------- #
# region 2.1 Построение графикоф.
# Основным элементом изображения, которое строит pyplot, является фигура (Figure), на неё накладывается одно или более
# поле с # графиками, оси координат, текстовые надписи и т.д. Для построения графика используется функция plot().
# В самом минимальном варианте её можно использовать без параметров:

# plt.plot()
# plt.show()

# Если в качестве параметра функции plot() передать список, то
# значения из этого списка будут отложены по оси ординат (ось y), а по оси
# абсцисс (ось x) будут отложены индексы элементов массива:

# plt.plot([1, 7, 3, 5, 11, 1])
# plt.show()

# Для того чтобы задать значения по осям X и Y, необходимо в plot()
# передать два списка:

plt.plot([1, 5, 10, 15, 11], [1, 7, 3, 5, 11])
plt.show()
