# Андрей однажды уже писал функции для расчёта площади сферы и объёма шара.
# И теперь для своей курсовой работы ему пришлось связаться с цилиндрами.

# Пользователь вводит два значения: радиус и высоту. Напишите функцию для расчёта
# площади боковой поверхности цилиндра и его полной площади. Функция должна
# возвращать два эти значения. После этого в основной программе выводятся оба ответа в две строки.

# Площадь боковой поверхности (r — радиус, h — высота):
# side = 2pi * r * h
# Полная площадь (S — площадь круга):
# full = side + 2 * s

import math


def cylindr_math(radius, height):
    side = 2 * math.pi * radius * height
    full = side + 2 * math.pi * radius ** 2
    return side, full


radius = int(input("Введите радиус: "))
height = int(input("Введите высоту: "))

bot_area, full_area = cylindr_math(radius, height)
print(f"Площадь боковой поверхности: {round(bot_area, 2)}\nПолная площадь: {round(full_area, 2)}")
