"""В базе данных одной компании есть баг (или, может быть, фича): если ввести туда имя сотрудника меньше чем из трёх
букв, то база сломается и упадёт. Как компания принимает на работу людей, например, с китайскими именами, непонятно.

Дан файл people.txt, в котором построчно хранится N имён пользователей.

Напишите программу, которая берёт количество символов в каждой строке файла и в качестве ответа выводит общую сумму.
Если в какой-либо строке меньше трёх символов (не считая литерала \n), то вызывается ошибка, и программа завершается."""

sym_sum = 0
count_line = 0

try:
    with open('people.txt', 'r', encoding='utf-8') as people_file:
        for i_line in people_file: # Перечисляем строки из файла.
            length = len(i_line) # Считаем кол-во знаков в строке.
            count_line += 1
            if i_line.endswith('\n'):
                length -= 1

            if length < 3:
                raise BaseException('Длина {} строки меньше трех символов'.format(count_line))
            sym_sum += length

except FileNotFoundError:
    print('Файл не найден!: ')

finally:
    print('Найденная сумма символов: ', sym_sum)
    print(people_file.closed)

