# Задача 1. Калькулятор опыта
# Что нужно сделать

# Андрей любит играть в компьютерные игры. В один прекрасный день у него появилась классная идея для сюжета своей игры.
# Чтобы воплотить её в жизнь, он начал изучать программирование и геймдизайн. Начал он с главного героя и его системы прокачки.

# Напишите программу, которая определяет уровень персонажа в компьютерной игре. Пользователь вводит число «очков опыта»,
# а программа вычисляет уровень. Новый уровень даётся при достижении 1000, 2500 и 5000 «очков опыта». Начальный уровень равен единице.

# Пример:
# Введите количество опыта: 6000
# Ваш уровень: 4

# Пример 2:
# Введите количество опыта: 2000
# Ваш уровень: 2
level_1 = 1000
level_2 = 2500
level_3 = 5000
points = int(input("Введите кол-во очков: "))
if points <= level_1:
    print("Ваш уровень 1")
elif points <= level_2:
    print("Ваш уровень 2")
elif points <= level_3:
    print("Ваш уровень 3")
else:
    print("Ваш уровень 4")