# Задача 3. Функция
# Что нужно сделать
#
# Учитель математики придумывает каждому своему ученику отдельные функции, которые нужно отобразить на
# графике и посчитать. А ещё этот учитель разбирается в программировании. Поэтому, чтобы не считать вручную все эти
# функции, он написал программу, которая делает всю работу за него.
#
# Напишите программу, которая получает от пользователя число X и вычисляет значение функции Y по следующей схеме:
# Напомним, как это работает:
# для X > 0, Y = X − 12
# для X = 0,  Y = 5
# для X < 0, Y = X²

x = int(input("Введите число X: "))
y = 0
if x > 0:
    y = x -12
elif x == 0:
    y = 5
else:
    y = x ** 2
print("Игрек равне", y)
