# Задача 6. Защита от дурака
# Что нужно сделать
# Вы участвуете в разработке приложения для математиков, где можно будет делать всё,
# начиная от простейших вычислений и заканчивая построением сложных графиков. В этом приложении
# реализована установка диапазона чисел, и вам необходимо написать этакую «защиту от дурака».

# Напишите программу, которая получает на вход число и проверяет, двузначное оно или нет. Выведите
# соответствующее сообщение. Числа −42 и −99 тоже считаются двузначными. Сделайте это, используя не
# более одного оператора if-elsе. Не используйте elif.

# Что оценивается
# результат вычислений корректен, поддерживаются отрицательные числа;
# задача решена без использования строк и операций с ними (конечно, это не относится к приведению целых чисел);
# input содержит корректное приглашение для ввода;
# переменные имеют значащие имена, не только a, b, c, d (видео 2.3);
# правильное употребление пробелов после запятых, при бинарных и логических операциях.

number = int(input("Введите любое число: "))
if (number > -100 and number < -10) or (number >= 10 and number < 100):
    print("Число двухзначное!")
else:
    print("Число не двухзначное!")