import os
folder_name = 'project'
file_name = 'lesson.txt'
path = os.path.join('docs', folder_name, file_name) # Получение относительного пути.
print(f'Относительный путь -->  {path}')
abs_path = os.path.abspath(file_name)
print(f'Абсолютный путь    -->  {abs_path}')

# Практическая работа по этому уроку.

# Задача 1. Сисадмин
# Вы работаете системным администратором в одной компании. На диске каждого сотрудника компании в специальной
# папке access лежит файл admin.bat. Этот файл предназначен для вас, и вам нужен путь до этого файла,
# причём как относительный, так и абсолютный.
# Недолго думая, вы решили написать небольшой скрипт, который закинете по сети к этому файлу.

print('\nРешение задачи 1. Сисадмин')
print(os.path.join('access',  'admin.bat')) # Получение относительного пути.
print(os.path.abspath(os.path.join('access',  'admin.bat'))) # Получение абсолютного пути.

# Задача 2. Содержимое
# Выберите любую директорию на своём диске и затем напишите программу,
# выводящую на экран абсолютные пути к файлам и папкам,
# которые находятся внутри этой директории.

print('\nРешение задачи 2. Содержимое')
print('Содержимое каталога', os.path.join(os.path.abspath('..')))
for path in os.listdir('..'):
    print(os.path.join(os.path.abspath('..'), path))

# Задача 3. Корень диска
# Напишите программу, которая выводит на экран корень диска и на этом диске запущен скрипт.
# Учтите, что скрипт может быть запущен где угодно и при любой вложенности папок.

print('\nРешение задачи 3. Корень диска')
print('Корень диска: ', os.path.abspath(os.sep).split(os.sep)[0])