# Задача 1. Космическая еда
# Ваш космический корабль потерпел крушение на пустынной планете. Еда здесь не растёт,
# но вы спасли из обломков 100-килограммовый мешок гречки. Из прошлого опыта вы знаете,
# что если будете экономно питаться, то у вас будет уходить по четыре килограмма гречки в месяц.

# Чтобы прикинуть гречневый бюджет, вы решили написать программу, которая выведет информацию о т
# ом, сколько килограммов гречки у вас должно быть в запасе через месяц, два и так далее, пока она не з
# акончится. Используйте цикл for.

weight = 100
month = 0
for n in range(1, (100 // 4) + 1, 1):
    weight -= 4
    print(f"Через {n} месяцев у вас должно остаться {weight} кг. гречки")