# Напишите программу, которая считывает с клавиатуры числа a, b и c,
# считает и выводит на консоль среднее арифметическое всех чисел из отрезка [a; b],
# кратных числу c.
a = int(input("Введите число a: "))
b = int(input("Введите число b: "))
c = int(input("Введите число c: "))
summ = 0
for i in range(a,b + 1,1):
    # print(i)  # Для проверки
    if i % c == 0:
        summ += i
        # print(f"Число {i} кратно {c}") # Для проверки
print(f"Сумма чисел на отрезке [{a, b}] кратное {c} равнв {summ}")