# Задача 6. Письмо
# Что нужно сделать

# У нас есть квадратный конверт размера 12х12 сантиметров и письмо на квадратном листе бумаги,
# которое не помещается в конверт. Напишите программу, которая подскажет, сколько раз нужно сложить
# письмо пополам, чтобы оно поместилось в конверт. Размеры письма вводятся с клавиатуры.

# Что оценивается
# Задание считается успешно выполненным, если:
# результат вывода соответствует условию;
# вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием);
# input содержит корректное приглашение для ввода;
# переменные имеют значащие имена, не только a, b, c, d.
# Советы и рекомендации
# Обратите внимание, что лист квадратный.
# Принимаем, что лист размером 12х12 свободно входит в конверт 12х12.

size_paper = int(input("Введите размер квадратного листка бумаги: "))
count = 0
while size_paper > 12:
    size_paper /= 2
    count += 2
print(f"Квадратный лист надо сложить {count} раз, \nчтобы уложить его в конверт размером 12*12 ")