# Задача 8. Сумма ряда
# Что нужно сделать
# Дано натуральное число n. Напишите программу для вычисления следующей
# суммы ряда (начиная с единицы):
# S = 1 -1/2 + 1/4 - 1/8 + ... + (-1) ** n * 1/2**n
# Что оценивается

# Задание считается успешно выполненным, если:
# результат вывода соответствует условию;
# input содержит корректное приглашение для ввода;
# переменные имеют значащие имена, не только a, b, c, d.
# Допускается вывод без описания, достаточно вывести сумму ряда.

# Советы и рекомендации
# Обратите внимание: если мы воспользуемся формулой для расчёта члена ряда, то
# при n = 0, член ряда равен 1;
# при n = 1, мы получим -1/2;
# при n = 2, мы получим 1/4;
# при n = 3, мы получим -1/8.

num = int(input('Введите число X: ' ))
summ = 0
for i in range(num + 1):
  expression = ((-1) ** i) * (1 / (2 ** i))
  summ += expression
print(summ)