# Задача 9. Выражение
# Что нужно сделать

# Дано число x. Напишите программу для вычисления следующего выражения:
# res= (x - 1)(x - 3)(x - 7)(x - 15)....(x - 63)/ (x - 2)(x - 4)(x - 8) * (x - 18)....(x-65)
# Советы и рекомендации...
# Обратите внимание на последовательность в числителе и знаменателе.
# Эта последовательность не является возрастающей арифметической
# последовательностью 1, 3, 5, 7 … 63 и 2, 4, 6, 8 … 64.

# Что оценивается
# Задание считается успешно выполненным, если:
# результат вывода соответствует условию;
# input содержит корректное приглашение для ввода;
# переменные имеют значащие имена, не только a, b, c, d.
# Допускается вывод без описания, достаточно вывести сумму ряда.

num = int(input('Введите число X: '))
numerator = 1
denominator = 1
for i in range(1, 7):
  numerator *= (num - (2 ** i - 1))
  denominator *= (num - 2 ** i)
if denominator == 0:
  print('Ошибка')
else:
  print(f"Результат  {numerator / denominator}")