# Записываем различные переменные
# a, b, c = 1, 2, 3
# a, b, c = 'abc'
# a, *b = [1, 2, 3]

# Примеры
# a, *b = [1, 2, 3, 4] # a = 1, b = [2, 3, 4] Звездочка <-- Это достань все остальное
# *a, b = [1, 2, 3, 4] # a = [1, 2, 3], b = 3
# a, *b, c = [1, 2, 3, 4] # a = 1, b = [2, 3], c = 4

# if __name__ == '__main__':
#     print(f'{a = }')
#     print(f'{b = }')
#     print(f'{c = }')
#     print(*[1, 2, 3]) # распаковывает список 1, 2, 3

# -------------------------------------------------------------------------------------------------------------------- #
# Позиционные аргументы.
# def example(a, b, /, c,* ,d):    # / <-- Ограничивает позиционные аргументы (все, что слева от /, должно быть позиционным)
#                                     # *, <-- Все что справа - только ключевые аргументы.
#     print(f'а = {a} ')
#     print(f'b = {b}')
#     print(f'c = {c}')
#     print(f'd = {d}')
#
# if __name__ == '__main__':
#     # example(1, 2, 3)
#     # example(1, 2, c=3) <-- Позиционные аргументы всегда идут в начале.
#     example(3, 2 , c = 1, d = 4)
# -------------------------------------------------------------------------------------------------------------------- #
# Примеры № 1
# def my_print(a, b):
#     print(f' а = {a}')
#     print(f' b = {b}')
#
# if __name__ == '__main__':
#     my_print(1, 2)
# -------------------------------------------------------------------------------------------------------------------- #
# Примеры № 2
# def my_print(a, *args):
#     print(f' а = {a}')
#     print(f' b = {args}')
#
# if __name__ == '__main__':
#     my_print(1, 2, 3, 4, 5)
# -------------------------------------------------------------------------------------------------------------------- #
# Примеры № 3
# def my_print(*args):
#     for arg in args:
#         print(str(arg))
#
# if __name__ == '__main__':
#     my_print(1, 2, 3, 4, 5)

# -------------------------------------------------------------------------------------------------------------------- #
# Примеры № 4
# def my_print(*args, number=1):
#     for arg in args:
#         print(str(arg) * number)
#
# if __name__ == '__main__':
#     my_print(1, 2, 3, 4, 5, number=3)
# -------------------------------------------------------------------------------------------------------------------- #
# Примеры № 5
# *args <-- собирает все позиционные аргументы в кортеж
# **kwargs <-- собирает все ключевые значения в словарь
def my_print(*args, **kwargs):
    print(f'Got keywords: {kwargs}')
    for arg in args:
        print(str(arg), **kwargs)

if __name__ == '__main__':
    my_print(1, 2, 3, 4, 5, sep = '', end = '\n' )