print("Практическая работа. Задача №4. Театр.")
# Планируется построить театр под открытым небом, но для начала нужно
# оценить, сколько должно быть рядов, сидений в ряду и какое лучше сделать расстояние между рядами.
# Напишите программу, которая получает на вход кол-во рядов, сидений и свободных метров между рядами,
# а затем выводит примерный макет театра на экран.

row = int(input("Введите кол-во рядов: "))
places = int(input("Введите кол-во мест: "))
meter = int(input("Введите кол-во свободных метров между рядами: "))
print("\n")
print("Сцена")
print("\n")
print
for row_maket in range(0,row):
    print("=" * places, " ", "*" * meter, " ", "=" * places)
