# Задача 7. Великий и могучий
# Что нужно сделать
# Паоло изучает русский язык: занимается по учебникам, читает книги, слушает музыку. Особенно Паоло понравилась книга
# “Преступление и наказание”. И ему стало интересно, как найти самое длинное слово в этой книге, чтобы потом сравнить
# его с аналогом на своём языке.

# Напишите программу, которая получает на вход текст и находит длину самого длинного слова в нём. Слова в тексте
# разделяются одним пробелом.

# Пример:
# Введите текст: Меня зовут Петр
# Самое длинное слово, букв: 5

# Что оценивается
# Задание считается успешно выполненным, если:
# результат вывода соответствует условию;
# input содержит корректное приглашение для ввода;
# вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием);
# Переменные имеют значащие имена, не только a, b, c, d (видео 2.3)

text = input(("Введите текст: "))
count_1 = 0
count_2 = 0
for i in text:
    if i != " ":
        count_1 += 1
    elif i == " " and count_1 > count_2:
        count_2 = count_1
        count_1 = 0
print(f"Максимально кол-во букв {count_2}")
