# Задача 8. Колонтитул
# Что нужно сделать
# Нам нужно написать программу для печати важных объявлений. Сверху объявления должен
# располагаться вот такой колонтитул:
# ~~~~~~~ !!!!!!! ~~~~~~~

# Восклицательные знаки всегда располагаются по центру строки, причём в зависимости от важности
# объявления количество восклицательных знаков может быть разным.
# Напишите программу, которая спрашивает у пользователя сначала общую длину колонтитула в символах,
# потом желаемое количество восклицательных знаков,
# после чего выводит на экран готовую строку.

# Что оценивается
# Задание считается успешно выполненным, если:
# результат вывода соответствует условию;
# Не допускаются дополнительные пробелы между “~” и “!”;
# вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием);
# Переменные имеют значащие имена, не только a, b, c, d (видео 2.3)

number = int(input("Общая длина колонтитула: "))
mark = int(input("Введите кол-во восклицательных знаков:"))
print(number // 2 * "~", " ", mark * "!", " ", number // 2 * "~")
