# Задача 3. Почта
# Василий пришёл получать посылку на почту. Разумеется, в почтовом извещении ему
# нужно было написать свои фамилию, имя и адрес проживания, чтобы кто-нибудь не
# получил посылку за него, например члены его семьи (а им бы хотелось!).

# Напишите функцию для вывода фамилии, имени и адреса для конкретного члена семьи.
# Выведите информацию о нём три раза (без цикла).

# Пример результата:
# Фамилия: Иванов
# Имя: Василий
# Улица: Пушкина
# Дом: 32

# Фамилия: Иванов
# Имя: Василий
# Улица: Пушкина
# Дом: 32

# Фамилия: Иванов
# Имя: Василий
# Улица: Пушкина
# Дом: 32

def mail_block():
    print((f"\nФамилия: {last_name}\nИмя: {first_name}\nУлица: {street}\nДом: {house}\n" * 3))

last_name = input("Введите вашу фамилию: ")
first_name = input("Введите ваше имя: ")
street = input("Введите вашу улицу: ")
house = input("Номер дома: ")
mail_block()