import wx
class MyFrame(wx.Frame): # <-- Создаем свой класс и наследуем его от стандартного класса Frame
    def __init__(self, parent, title):
        """
        :param parent: Ссылка на родительское окно с которым связан данный фрейм.
        :param title: Название окна
        """
        super().__init__(parent, title=title) # Вызывается конструктор базового класса (wx. Frame)

app = wx.App()  # <- Инициализация приложения.
frame = MyFrame(None, 'Hello Water-wave') # <-- Название заголовка.
frame.Show()    # <-- Вывести окно на экран.
app.MainLoop()

# wx...
# ...PopupWindows <-- Специальный оконный класс для создания popup меню, списков combox и других вспомогательных
# виджетов подобного рода.
# ...ScrollerWindows <-- Используется для создания окна с покручиваемым содержимым.

# ...Frame <-- Используется для создания стандартного окна.
# ...MIDIParentFrame (Multiple Document Interface) <-- класс, содержащий дочерние оконные классы (как пример,
# Photoshop со множеством открытых документов)
# ...MIDIChildFrame <-- Создает окно внутри класса MIDIParentFrame
# ...Dialog <-- создает диалоговое окно.

# SplitterWindow <-- Контейнер с разделительной полосой, которую можно перемещать, изменяя размеры соответствующих
# содержимых.
# Notebook <-- Используется для создания tab - интерфейса (панель со вкладками)

# Виджеты - для динамических (т.е. их содержимое может меняться)
# Button <-- Обычная кнопка.
# BitmapButton <-- Кнопка с картинкой.
# ToggleButton <-- Кнопка переключатель.
# SpinButton <-- Стрелочка вверх.вниз
# RadioButton <-- радио-кнопка (кружочек с точкой)
# CheckBox <-- чекбокс(флажок)
# TextCtrl <-- поле ввода текста
# SpinCtrl <-- поле ввода со стрелочками вверх.вниз
# ComboBox <-- выпадающий список с возможностью ввода выбора.
# Choice <-- выпадающий список только с возможностью выбора.
# Slider <-- бегунок.
# ScrollBar <-- скроллинг
# Grid <--таблица (наподобие excel)
# RadioBox <--контейнер для RadioButton
# ListBox <-- Список

# Виджеты - для статических изображений
# StaticBitmap <-- Для статических изображений
# StaticBox <-- Квадратная рамка
# Gauge <-- прогресс бар
# StaticText <-- простой текст
# StaticLine <-- линия


