# Роман и Мария играют в игру. Роман загадал натуральное число от 1 до N.
# Мария пытается угадать это число, для этого он называет несколько чисел 
# подряд. Роман говорит Мария «да», если среди названных Мария чисел
# есть задуманное. В противном случае Роман говорит «нет». 
# После нескольких заданных вопросов Мария сдалася и попросила вас помочь
# ему определить, какие числа мог задумать Роман.
# 
# Напишите программу, которая имитирует диалог Романа и Мария.
# В начале на вход подаётся число N — это максимальное число, которое 
# мог загадать Роман. Затем Мария предполагает, что среди некоторых чисел 
# есть то, которое загадал Роман (несколько чисел через пробел), а Роман 
# отвечает. Так продолжается до тех пор, пока Мария не попросит помощи 
# (пока не введётся строка «Помогите!»). В конце программы необходимо
# вывести, какие числа мог загадать Роман.

# Пример реализации:
# Введите максимальное число: 10
# Нужное число есть среди вот этих чисел: 1 2 3 4 5
# Ответ Романа: Да
# Нужное число есть среди вот этих чисел: 2 4 6 8 10
# Ответ Романа: Нет
# Нужное число есть среди вот этих чисел: Помогите! 
# Роман мог загадать следующие числа: 1 3 5

import random
max_number = int(input("Введите максимальное число: "))
number_dict = dict()
number_dict = {number + 1 for number in range(max_number)}
print(number_dict, " <-- number_dick")

hidden_number = random.randint(1, max_number)
print(hidden_number)
last_number = {}

while True:
    number_txt = set(input("Нужное число есть среди этих чисел: ").split())
    print(number_txt, "Number_txt")

    for search_number in number_txt:
        if int(search_number) == hidden_number:
            print("Ответ Романа: Да")
            break
    else:
        for diggit in number_txt:
            last_number = last_number.update(diggit)

        print(last_number, " <-- last_number")
        print("Ответ Романа: Нет")


