# В базе данных интернет-магазина PizzaTime хранятся данные о том, кто, что и сколько заказывал
# у них в определённый период. Вам нужно структурировать эту информацию, а также понять,
# сколько всего пицц купил каждый заказчик.

# На вход в программу подаётся N заказов. Каждый заказ представляет собой строку вида
# «Покупатель — название пиццы — количество заказанных пицц». Реализуйте код, который
# выводит список покупателей и их заказов по алфавиту. Учитывайте, что один человек может
# заказать одно и то же несколько раз.

# Пример:
# Введите количество заказов: 6
# Первый заказ: Иванов Пепперони 1
# Второй заказ: Петров Де-Люкс 2
# Третий заказ: Иванов Мясная 3
# Четвёртый заказ: Иванов Мексиканская 2
# Пятый заказ: Иванов Пепперони 2
# Шестой заказ: Петров Интересная 5

# Иванов:
#     Мексиканская: 2
#     Мясная: 3
#     Пепперони: 3

# Петров:
#     Де-Люкс: 2
#     Интересная: 5

database = dict()
number_order = int(input("Введите количество заказов: "))

for number in range(number_order):
    order = input(f"{number + 1 } -й заказ: ").split()
    if order[0] in database:
        if order[1] in database[order[0]]:
            database[order[0]][order[1]] += int(order[2])
        else:
            database[order[0]][order[1]] = order[2]
    else:
        database[order[0]] = dict({order[1]: int(order[2])})
    print(database)

for elem_1 in sorted(database):
    print(f"\n{elem_1}:")
    for elem_2 in sorted(database[elem_1]):
        print(f"\t{elem_2}: {database[elem_1][elem_2]}")
