# Антон, помимо программирования, также увлекается и географией,
# поэтому он решил связать эти две области и написать для своего проекта
# небольшую программу-навигатор.

# Пользователь вводит количество стран N, а затем N раз вводит страну и по три
# города, которые в этой стране находятся, в одну строку. Реализуйте такую
# программу и для каждого из трёх городов укажите, в какой стране он находится.
# Если такого города нет,
# то выведите соответствующее сообщение.

# Пример:
# Количество стран: 2
# Первая страна: Россия Москва Петербург Новгород
# Вторая страна: Германия Берлин Лейпциг Мюнхен

# Первый город: Москва
# Город Москва расположен в стране Россия.
# Второй город: Мюнхен
# Город Мюнхен расположен в стране Германия.
# Третий город: Рим
# По городу Рим данных нет.


def search_city(country_dict, input_city):
    for country in country_dict:
        for city in country_dict[country]:
            if input_city == city:
                print(f"Город {input_city} расположен в стране {country}")
                return
    else:
        print(f"По городу {input_city} данных нет")

# --------------------------------------------------
number_country = int(input("Введите количество стран: "))
country_dict = dict()

for country in range(number_country):
    country_str = input(f"Страна {country + 1 }"
                        f" (Название и три города этой страны через пробел)\n: ").split()
    for sym in range(len(country_str)):
        country_dict[country_str[0]] = country_str[1::]

for request in range(3):
    print(f"{request + 1}-й город: ", end="")
    input_city = input()
    search_city(country_dict, input_city)