# Одна библиотека поручила вам написать программу для оцифровки словарей синонимов.
# На вход в программу подаётся N пар слов. Каждое слово является синонимом к своему
# парному слову.

# Реализуйте код, который составляет словарь синонимов (все слова в словаре различны),
# затем запрашивает у пользователя слово и выводит на экран его синоним. Обеспечьте
# контроль ввода: если такого слова нет, то выведите ошибку и запросите слово ещё раз.
# При этом проверка не должна зависеть от регистра символов.

# Пример:
# Введите количество пар слов: 3
# Первая пара: Привет - Здравствуйте
# Вторая пара: Печально - Грустно
# Третья пара: Весело - Радостно

# Введите слово: интересно
# Такого слова в словаре нет.
# Введите слово: здравствуйте
# Синоним: Привет


def search_synonym(word):
    search_word = input("Введите слово: ").lower()
    synonim_word = {}
    for new in word:
        if word[new][0] == search_word:
            print(f"Синоним: {word[new][1]}")
            break
        if word[new][1] == search_word:
            print(f"Синоним: {word[new][0]}")
            break
    else:
        print("Такого слова в словаре нет.")
        search_synonym(word)

#--------------------------------------------------
word_couple = int(input("Введите количество пар слов: "))
word_dict = {}
print("Слова заносятся через тире!")
for number_couple in range(word_couple):
    word_dict[number_couple] = input(f"{number_couple + 1}-я пара: ").lower().split(' - ')

search_synonym(word_dict)