# Что нужно сделать
# В программировании иногда возникает ситуация, когда работу функции нужно замедлить. Типичный пример — функция,
# которая постоянно проверяет, изменились ли данные на веб-странице или её код.

# Реализуйте декоратор, который перед выполнением декорируемой функции ждёт несколько секунд.

import time
def timer(func):
    """Декоратор, делающий паузу перед выполнением программы"""
    def wrapper():
        for sec in range(4, 0, -1):
            print(f"Программа запуститься через {sec} секунд...", end="")
            time.sleep(1.0)
            print('\r', end='')
        return func()
    return wrapper

@timer
def my_func():
    print("Start work")

my_func()