# Задача 3. Логирование
# Что нужно сделать.
# Реализуйте декоратор logging, который будет отвечать за логирование функций. На экран выводится название функции и её
# документация. Если во время выполнения декорируемой функции возникла ошибка, то в файл function_errors.log
# записываются название функции и ошибки.

# Также постарайтесь сделать так, чтобы программа не завершалась после обнаружения первой же ошибки, а обрабатывала все
# декорируемые функции и сразу записывала все ошибки в файл.

# Дополнительно: запишите дату и время возникновения ошибки, используя модуль datetime.

import functools
def logging():
    """Функция Логирования """
    def log():
        print("")
    return log

@ logging
def test_error():
    """Тестовая функция с ошибкой."""
    print(f"Сработала функция {test_error.__name__} ({test_error.__doc__})" )
    try:
        print("Opening file...")
        open_file = open("data.txt")
    except FileNotFoundError:
        print("File not found!")

    except Exception:
        print("Something gone wrong!")


my_logger = test_error()


