# Что нужно сделать
# В прошлый раз учитель написал программу, которая выводит числа в формате плавающей точки, 
# однако он вспомнил, что не учёл одну важную штуку: числа-то могут идти от нуля.

# Задано положительное число x (x > 0). Ваша задача преобразовать его в формат плавающей точки, 
# то есть x = a · 10 ^ b, где 1≤a<10. Обратите внимание, что x теперь больше нуля, а не больше единицы. Обеспечьте контроль ввода.

# Пример 1:
# Введите число: 92345
# Формат плавающей точки: x = 9.2345 * 10 ** 4

# Пример 2:
# Введите число: 0.0012
# Формат плавающей точки: x = 1.2 * 10 ** -3

# number = float(input("Введите число: "))
# count = 0
# if number > 1:
#     while number > 10:
#         count += 1
#         number /= 10
# else:
#     while number < 1:
#         count -= 1
#         number *= 10
# print(f"Формат плавающей точки: x = {number} * 10 ** {count}")


def more(number):
    count = 0
    while number > 10:
        count += 1
        number /= 10
    print(f"Формат плавающей точки: x = {number} * 10 ** {count}")
    menu()

def less(number):
    count = 0
    while number < 1:
        count -= 1
        number *= 10
    print(f"Формат плавающей точки: x = {round(number , 2)} * 10 ** {count}")
    menu()

def menu():
    number = float(input("Введите число: "))
    if number > 10:
        more(number)
    elif number <= 0:
        print("Число должно быть положительным.")
        menu()
    else:
        less(number)

menu()


