# Что нужно сделать
# Юра пишет различные полезные функции для Питона, чтобы остальным программистам стало проще
# работать. Он захотел написать функцию, которая будет находить максимум из перечисленных чисел.
# Функция для нахождения максимума из двух чисел у него уже есть. Юра задумался: может быть,
# её можно как-то использовать для нахождения максимума уже от трёх чисел?

# Помогите написать Юре функцию, которая находит максимум из трёх чисел. Для этого используйте
# только функцию нахождения максимума из двух чисел.

# Что оценивается
# результат вывода соответствует условию;
# Найден корректный максимум трех чисел;
# input содержит корректное приглашение для ввода;
# вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием);

def max_num(x, y):
  if x > y:
    return x
  else:
    return y

first_number = int(input('Введите первое число: '))
second_number = int(input('Введите второе число: '))
third_number = int(input('Введите третье число: '))

print('Наибольшее число: ', max_num(max_num(first_number, second_number), third_number))

