# Что нужно сделать
#
# Пользователь вводит два числа — N и K. Напишите программу, которая заменяет каждое число на число,
# которое получается из исходного записью его цифр в обратном порядке, затем складывает их,
# снова переворачивает и выводит ответ на экран.

# Пример:
# Введите первое число: 102
# Введите второе число: 123
# Первое число наоборот: 201
# Второе число наоборот: 321
# Сумма: 522
# Сумма наоборот: 225

def revers(x):
    digit = 0
    while x > 0:
        digit += x % 10
        x //= 10
        digit *= 10
    return digit // 10

N = int(input("Введите первое число: "))
K = int(input("Введите второе число: "))
newN = revers(N)
newK = revers(K)
print(f"Первое число наоборот: {newN}")
print(f"Второе число наоборот: {newK}")
print(f"Сумма: {newN + newK}")
print(f"Сумма наоборот: {revers(newK + newN)}")

