# Что нужно сделать
# Наконец-то учитель смог объяснить детям, что такое эта «плавающая точка». Однако долго его радость не продлилась,
# ведь на следующем уроке нужно будет объяснить такие страшные слова, как «экспоненциальное», «мантисса» и
# «порядок». Хоть старшеклассники и знакомы с экспонентой, учитель всё равно не уверен, что здесь всё будет понятно.
# Поэтому для наглядности он также написал программу.

# На вход подаётся строка — это экспоненциальная форма числа. Напишите программу, которая выводит отдельно
# мантиссу и отдельно порядок этого числа.

# Что оценивается
# результат вывода соответствует условию;
# input содержит корректное приглашение для ввода;
# вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием);

number = input('Введите число в экспоненциальной форме, например, 452e-3: ')

mantissa = order = ''
flag = True
for i in number:
    # На всякий случай проверим и русские еЕ
    if i == 'e' or i == 'E' or i == 'е' or i == 'Е':
        flag = False
    elif flag:
        mantissa += i
    else:
        order += i

if(flag): # если флаг так и не сбросился
  print('Ошибка ввода!')
else:
  print(f"{mantissa} <-- это мантиса.\n{order} <-- это порядок числа.")
