# Что нужно сделать
# Вы всё так же работаете в конторе по разработке игр и смотрите различные программы
# прошлого горе-программиста. В одной из игр для детей, связанной с мультяшной работой
# с числами, вам нужно было написать код по следующим условиям: программа получает
# на вход два числа. В первом числе должно быть не меньше трёх цифр, во втором числе — не меньше
# четырёх, иначе программа выдаёт ошибку. Если всё нормально, то в каждом числе первая
# и последняя цифра меняются местами, а затем выводится их сумма.

# И тут вы натыкаетесь на программу, которая была написана прошлым программистом. И
# которая как раз решает такую задачу! Однако старший программист сказал вам немного
# переписать этот код, чтобы он не выглядел так ужасно. Да и вам самим становится,
# мягко говоря, не по себе от него.

# Разбейте приведённую ниже программу на функции. Повторений кода должно быть как
# можно меньше. Также сделайте, чтобы в основной части программы был только ввод
# чисел, затем изменённые числа и вывод их суммы.

# ------------------------------
# Счетчик чисел
def countDigit(number):
    num_count = 0
    temp = number
    while temp > 0:
        num_count += 1
        temp = temp // 10
    return num_count

# Меняем число
def replacement(number,num_count):
        summ = 0
        last_digit = number % 10
        digit = number // 10 ** (num_count - 1)
        between_digits = number % 10 ** (num_count - 1) // 10
        number = last_digit * 10 ** (num_count - 1) + between_digits * 10 + digit
        print(f"Перевернутое число: {number}\n")
        return number

# Проверка второго числа
def menu_2():
    number_2 = int(input("Введите второе число (4 и более цифр): "))
    num_count = countDigit(number_2)
    if num_count < 4:
        print("Во втором числе меньше четырех цифр!")
        menu_2()
    rev_num_2 = replacement(number_2, num_count)
    return (rev_num_2)

#Проверка первого числа
def menu_1():
    number_1 = int(input("Введите первое число (3 и более цифр): "))
    num_count = countDigit(number_1)
    if num_count < 3:
        print("В первом числе меньше трёх цифр.")
        menu_1()
    rev_num_1 = replacement(number_1, num_count)
    return rev_num_1

rev_num_1 = menu_1()
rev_num_2 = menu_2()

print(f"Сумма этих чисел {rev_num_1 + rev_num_2}")
