# Что нужно сделать
#
# Известно, что амплитуда качающегося маятника с каждым разом затухает на 8,4%
# от амплитуды прошлого колебания. Если качнуть маятник, то, строго говоря, он не
# остановится никогда, просто амплитуда будет постоянно уменьшаться до тех пор,
# пока мы не сочтём такой маятник остановившимся. Напишите программу, определяющую,
# сколько раз качнётся маятник, прежде чем он, по нашему мнению, остановится.

# Программа получает на вход начальную амплитуду колебания в сантиметрах и конечную
# амплитуду его колебаний, которая считается остановкой маятника. Обеспечьте контроль ввода.

# Пример:
# Введите начальную амплитуду: 1
# Введите амплитуду остановки: 0.1
# Маятник считается остановившимся через 27 колебаний

# Что оценивается
# результат вывода соответствует условию;
# input содержит корректное приглашение для ввода;
# формат вывода соответствует примеру;
# вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием);

amplitude = int(input("Введите амплитуду: "))
stop_amplitude = float(input("Введите амплитуду остановки: "))
count = 0
while amplitude >= stop_amplitude:
    amplitude -= amplitude / 100 * 8.4
    count += 1
print(f"Маятник считается остановившимся через {count} колебаний")
