# Задача 1. Кубы чисел
# Что нужно сделать
# У любителя математики Паши есть распечатанные таблички со степенями двойки.
# Теперь он хочет взять степень тройки от единицы до абсолютно любого числа!

# Напишите программу, которая возводит в третью степень каждое число от 1 до N и выводит результат на экран.

# Что оценивается
# результат вывода корректен, решение использует цикл while;
# input содержит корректное приглашение для ввода;
# переменные имеют значащие имена, не только a, b, c, d (видео 2.3);
# правильное употребление пробелов после запятых и при бинарных операциях.

n = int(input("Введите количество цифр возводимых в степень: "))
number = 1
while number <= n:
    print(number ** 3)
    number += 1

