# Задача 3. Слишком большие числа
# Что нужно сделать
# У неудачливого бухгалтера всё опять идёт наперекосяк: ему приносят такие большие счета, что числа не помещаются на бумаге.
# Напишите программу, которая считала бы для него, сколько цифр во вводимом числе.
# Обратите внимание, что число 0 имеет 1 цифру.

# Что оценивается
# input содержит корректное приглашение для ввода;
# результат вывода корректен, правильно подсчитано количество цифр в числе;
# переменные имеют значащие имена, не только a, b, c, d (видео 2.3);
# правильное употребление пробелов после запятых и при бинарных операциях;
# используется цикл while;
# решение не использует работу со строками и операции над ними.

numm = int(input('Введите число: '))
x = 1
while numm > 10:
    numm /= 10
    x += 1
print('В числе', x, 'знаков.')