print("Нихрена не понял условие задачи-тупо скачал решение.")
# Задача 4. Календари
# Что нужно сделать
# Ваня увлекается историей, в особенности календарями. Он изучает календари разных времён,
# эпох и народностей. Для исследования ему нужно посчитать, у кого сколько было месяцев с чётным количеством дней.
# Напишите программу, которая считает количество месяцев с четным количеством дней и при вводе нуля выводит ответ на экран.

# Что оценивается
# input содержит корректное приглашение для ввода;
# результат вычислений корректен, ввод осуществляется внутри цикла;
# при вводе 0 происходит выход из цикла;
# переменные имеют значащие имена, не только a, b, c, d (видео 2.3);
# правильное употребление пробелов после запятых и при бинарных операциях.

sequence = int(input('Введите последовательность чисел: '))
summ = 0
while sequence != 0:
  last_num = sequence % 10
  even = last_num % 2
  if even == int():
    summ += 1
  if last_num == 0:
    print('Разрыв последовательности!')
    break
  sequence //= 10
print(summ)