# Задача 5. Счастливый билетик
# Что нужно сделать
# В старину, когда даже в столице билеты в общественном транспорте выдавали контролёры,
# cуществовало поверье: если на билете сумма первых трёх цифр в номере билета равна сумме последних трёх, то это к удаче.

# Напишите программу, которая получала бы на входе номер билета из четного количества цифр и
# выводила, счастливый это билет или нет. К примеру, билеты 666 666 и 252 135 — счастливые, а 123 456 — нет.

# Что оценивается
# input содержит корректное приглашение для ввода;
# результат вычислений корректен;
# решать задание нужно в цикле;
# в решении не используются работа со строками и операции над ними;
# переменные имеют значащие имена, не только a, b, c, d (видео 2.3);
# правильное употребление пробелов после запятых и при бинарных операциях.

while True:
    number = int(input("Введите номер билетика: "))
    summ_1 = number // 100000 + number // 10000 % 10 + number // 1000 % 10
    summ_2 = number % 10 + number % 100 // 10 + number % 1000 // 100
    if summ_1 == summ_2:
        print("Счастливый билетик")
    else:
        print("Билет не счастливый")