# Задача 8. Вклады
# Что нужно сделать
# Вклад в банке составляет X рублей. Ежегодно он увеличивается на P процентов,
# после чего дробная часть копеек отбрасывается. Определите, через сколько лет вклад
# составит не менее Y рублей.

# Напишите программу, которая по данным числам X, Y, P определяет, сколько лет пройдёт,
# прежде чем сумма достигнет значения Y.

# Что оценивается
# результат вычислений корректен;
# input содержит корректное приглашение для ввода;
# переменные имеют значащие имена, не только a, b, c, d (видео 2.3);
# правильное употребление пробелов после запятых и при бинарных операциях.

x = int(input("Какой вклад в банк?: "))
p = int(input("Какой процент в банке?: "))
y = int(input("Планируема конечная сумма?: "))
count_year = 0
while x <= y:
    x += x / 100 * p
    count_year += 1
print("Планируемая сумма достигнет через", count_year, "лет")