# Задача 10. Игра «Компьютер угадывает число»
# Что нужно сделать

# Поменяйте мальчика и компьютер из прошлой задачи местами.
# Теперь мальчик загадывает число между 1 и 100 (включительно).
# Компьютер может спросить у мальчика: «Твоё число равно, меньше
# или больше, чем число N?», где N — число, которое хочет проверить
# компьютер. Мальчик отвечает одним из трёх чисел: 1 — равно, 2 — больше, 3 — меньше.

# Напишите программу, которая с помощью цепочки таких вопросов и
# ответов мальчика угадывает число.

# Дополнительно: сделайте так, чтобы можно было гарантированно
# угадать число за семь попыток.

# Подсказка:
# Используйте бинарный поиск, а не конкатенацию.

# Что оценивается
# результат вычислений корректен;
# input содержит корректное приглашение для ввода;
# правильное употребление пробелов после запятых и при бинарных операциях.

number = int(input("Загадайте число от 1 до 100 включительно: "))
n = 50
while True:
    print("Твоё число равно, меньше или больше, чем число", n)
    comp = int(input("1 — равно, 2 — больше, 3 — меньше: "))
    if comp == 2:
        n += n // 2
        print(n)
    elif comp == 3:
        n -= n // 2
        print(n)
    else:
        print("Загаданное число:", n)
        break