# Задача 3. Квадраты нечётных чисел
# Вводится число N. Напишите программу, которая выводит квадраты нечетных чисел от 1 до N.
# Нельзя использовать условные операторы. Можно использовать цикл while, но постарайтесь всё-таки
# решить с помощью конструкции for in range. Не нужно искать решение в интернете, попробуйте подумать
# сами, в следующем уроке мы обязательно разберём эту задачу.

# Мое решение
n = int(input("Введите число N: "))
number_2 = 1
for number_1 in range(1, n):
    if number_1 == number_2:
        number_2 += 2
        print(number_1, "в степени 2 =", number_1 ** 2)

# Типо правильное решение
n = int(input("До какого числа выводить квадраты: "))
for i in range(1, n // 2 + 1):
    odd_number = i * 2 - 1
    print("Число:", odd_number, "Квадрат числа:", odd_number ** 2)

