# Задача 3. Диета
# Саша просыпается когда угодно, но в 23 часа уже точно идёт спать.
# Питается Саша следующим образом: каждые 3 часа он выпивает литр воды и съедает
# N калорий. Пить и есть он, кстати, начинает сразу как только проснётся. Напишите программу,
# которая считает сколько он выпьет литров воды и сколько калорий он съест перед тем как пойдёт спать.

wake_up = int(input("Во сколько проснулся Саша?: "))
water = 0
calories = 0
for i in range(wake_up,23,3):
    water += 1
    calories += int(input("Введите кол-во съеденных калорий"))
print(f"Всего выпито Сашей воды {water} литров и съедено {calories} калорий.")