# Напишите программу, которая проверяет то, как вы умеете складывать два числа в уме. Программа получает на вход два числа и
# предполагаемую сумму и должна выводить два разных сообщения — на верный и неверный ответ пользователя. В последнем случае
# надо показывать правильный результат.
# Пример:
# Введите первое число: 3
# Введите второе число: 10
# Сумма этих чисел: 13
# Ответ верный!
# Пример 2:
# Введите первое число: 3
# Введите второе число: 10
# Сумма этих чисел: 14
# Ответ неверный!

number_1 =int(input("Введите первое число: "))
number_2 =int(input("Введите второе число: "))
res = int(input("Сумма этих чисел: "))
if res == number_1 + number_2:
    print("Ответ верный!")
else:
    print("Ответ не верный")