print("Урок 4.2 - Условный оператор")
# bank = int(input("Что-бы купить курс, скажите сколько денег на счету:"))
# if bank > 75000:
#     print("Денег хватает на покупку курса.")
# else:
#     print("Курс не сможем купить!")

print("Пример №2")
# sun = int(input("Какое число я загадал?"))
# father = 5
# if sun == father:
#     print("Число отгадано!")
# else:
#     print("Не верно!)))")

print("Решение домашки № 1")
# a = 6
# b = 2
# c = 0
# if b < a:
#     c = a * b
#     print(c)

print("Решение домашки № 2")
# bank = int(input("Что-бы купить курс, скажите сколько денег на счету:"))
# if bank >= 75000:
#     print("Курс успешно приобретен.")
# else:
#     print("Курс не сможем купить!")
# print("Хорошего дня.")
# print("----------------------------------------------")

print("Урок 4.3 - Полная форма условного оператора if")
# orange = int(input("Введите кол-во апельсинов: "))
# apple = int(input("Введите кол-во яблок: "))
# expenses = int(input("Рассходы равны: "))
# if apple + orange > expenses:
#     print("Доходы превышают рассходы")
# else:
#     print("Доходы меньше рассходов!!! ")
# print("Урок 4.4 - комментарии ")
# print("----------------------------------------------")

