class Geom: # Базовый класс.
    name = 'Geom'

    # def draw(self):  # Прописан метод, который есть в дочернем классе,
    #     # то метод в дочернем классе будет называться переопределением
    #     print('Рисование линии.')

    def __init__(self, x1, y1, x2, y2):
        print(f'Инициализатор Geom для {self.__class__}.')
        self.x1 = x1
        self.y1 = y1
        self.x2 = x2
        self.y2 = y2

class Line(Geom):   # Дочерний класс.
    def draw(self): # В котором прописан метод, то называется расширением базового класса.
        print('Рисование линии.')

class Rect(Geom):   # Дочерний класс.
    def __init__(self, x1, y1, x2, y2, fill = None):
        super().__init__(x1, y1, x2, y2) # <-- Инициализатор базового класса надо вызывать в первую очередь.
        # super().__init__(x1, y1, x2, y2) <-- Называется делегированием.
        print('Инициализатор прямоугольника.')
        self.fill = fill

    def draw(self): # В котором прописан метод, то называется расширением базового класса.
        print('Рисование прямоугольника.')

l = Line(0, 0, 10, 20)
r = Rect(1, 2, 3, 4)
print(l.__dict__)
print(r.__dict__)

