# print('Я к вам пишу - чего же боле?')
# print('Что я могу еще сказать?')
# print('Теперь, я знаю, в вашей воле')
# print('Меня презреньем наказать.')
# print('Но вы, к моей несчастной доле')
# print('Хоть каплю жалости храня,')
# print('Вы не оставите меня.')

# Ошибки возникающие в процессе выполнения программы <-- Исключение в процессе
# выполнения.
# Ошибки возникающие в процессе компиляции программы <-- Синтаксические ошибки.

# ------------------------------------------------------------------------------------------------ #
# Пример № 1
# try:
#     f = open('# 28 lesoon.txt')
# except FileNotFoundError:
#     print('Искомый файл не найден.')
# ------------------------------------------------------------------------------------------------ #
# Пример № 2 Ошибка типа данных
# try:
#     x ,y = map(int, input('Введитe два числа через пробел: ').split())
# except ValueError:
#     print('Ошибка типа данных.')
# ------------------------------------------------------------------------------------------------ #
# Пример № 4 Деление на ноль
# try:
#     x ,y = map(int, input('Введитe два числа через пробел: ').split())
#     res = x / y
# except ValueError:
#     print('Ошибка типа данных.')
# except ZeroDivisionError:
#     print('На ноль делить нельзя')
# ------------------------------------------------------------------------------------------------ #
# Пример № 5 Запись двух исключений одновременно Ввод данных и Деление на ноль
# try:
#     x ,y = map(int, input('Введитe два числа через пробел: ').split())
#     res = x / y
# except (ValueError, ZeroDivisionError) :
#     print('Ошибка типа данных.')
# ------------------------------------------------------------------------------------------------ #
# Пример № 6 Ввод данных и Деление на ноль
# try:
#     x ,y = map(int, input('Введитe два числа через пробел: ').split())
#     res = x / y
# except ArithmeticError : # ArithmeticError <-- Это класс позволяющий отлавливать все дочерние
#     # исключения.
#     print('Деление на ноль.')
# ------------------------------------------------------------------------------------------------ #
# Пример № 6 Ввод данных и Деление на ноль
# try:
#     x ,y = map(int, input('Введитe два числа через пробел: ').split())
#     res = x / y
# except Exception : # Exception <-- Это класс выше чем ArithmeticError позволяющий отлавливать все
#     print('Деление на ноль.')
# ------------------------------------------------------------------------------------------------ #
# Пример № 7 Вывод стандартных сообщений об ошибках.
try:
    x ,y = map(int, input('Введитe два числа через пробел: ').split())
    res = x / y
except Exception as error : # Exception <-- Это класс выше чем ArithmeticError позволяющий
    # отлавливать
    # все
    print(error)
