# Задача 1. Сумма чисел 2
# Пользователь вводит число N. Напишите функцию summa_n, которая принимает одно
# целое положительное число N и находит сумму всех чисел от 1 до N включительно.
# Функция вызывается два раза: сначала от числа N, а затем от полученной суммы.

# Пример работы программы:
# Введите число: 5
# Сумма от 1 до 5 = 15
# Сумма от 1 до 15 = 120

def summ(N):
    count = 0
    for summ in range(1, N + 1):
        count += summ
    return count

N = int(input("Введите количество чисел в последовательности: "))

totalSumm = summ(N)
newSumm = summ(totalSumm)

print(f"Сумма от 1 до {N} = {totalSumm}")
print(f"Сумма от 1 до {totalSumm} = {newSumm}")