print("Практика - Задача № 1 - Врата .")
# Напишите программу, которая выводит в консоль «врата», состоящие из тире, вертикальных линий и пробелов. Поле состоит
# из 20 строк и 30 столбцов (но не стесняйтесь пробовать и другие размеры).
for row in range(20):
    for col in range(50):
        if row == 0:
            print('-', end = "")
        elif col == 0:
            print('|', end = "")
        elif col == 49:
            print('|', end = "")
        else:
            print(" ", end = "")
    print()