# Задача 4. Турнир
# Что нужно сделать
# В файле first_tour.txt записано число K и данные об участниках турнира по настольной игре «Орлеан»: фамилии, имена и
# количество баллов, набранных в первом туре. Во второй тур проходят участники, которые набрали более K баллов в первом
# туре.

# Напишите программу, которая выводит в файл second_tour.txt данные всех участников, прошедших во второй тур, с
# нумерацией.

# В первой строке нужно вывести в файл second_tour.txt количество участников второго тура. Затем программа должна
# вывести фамилии, инициалы и количество баллов всех участников, прошедших во второй тур, с нумерацией. Имя нужно
# сократить до одной буквы. Список должен быть отсортирован по убыванию набранных баллов.

# Пример:

# Содержимое файла first_tour.txt:
# 80
# Ivanov Serg 80
# Sergeev Petr 92
# Petrov Vasiliy 98
# Vasiliev Maxim 78

# Содержимое файла second_tour.txt:
# 2
# 1) V. Petrov 98
# 2) P. Sergeev 92

# Что оценивается
# Результат вычислений корректен.
# Формат вывода соответствует примеру.
# Основной функционал описан в отдельных функциях.
# Переменные и функции имеют значащие имена, а не только a, b, c, d (подробнее об этом в видео 2.3).
# Входные и выходные файлы названы так, как указано в задании.

print('Решение задачи № 4')
lines = []

with open(r'first_tour.txt', 'r', encoding='utf-8') as first_tour:
    [lines.append(line) for line in first_tour]
    for index, i_ment in enumerate(lines):
        res = 0

        for search_int in i_ment:
            for number in range(0, 9):
                if search_int == str(number):
                    res = ()
        print(res)




    # [print(lines[number_str], end='') for number_str in range(len(lines))]






