# Илья решил безобидно подшутить над другом и написал
# программу для смартфона, которая при отправке сообщения удваивает каждый
# символ строки и заодно к каждому удвоенному добавляет ещё один дополнительный.

# Пользователь вводит строку и дополнительный символ. Напишите программу,
# которая генерирует два списка: в первом списке каждый элемент — удвоенная
# буква первой строки, во втором списке каждый элемент — конкатенация
# элемента первого списка и дополнительного символа.

# Пример:
# Введите строку: привет
# Введите дополнительный символ: !

# Список удвоенных символов: ['пп', 'рр', 'ии', 'вв', 'ее', 'тт']
# Склейка с дополнительным символом: ['пп!', 'рр!', 'ии!', 'вв!', 'ее!', 'тт!']


incoming_msg = input("Введите строку: ")
special_symbol = input("Введите дополнительный символ: ")

doubled_letters = [letter * 2 for letter in incoming_msg]
result_msg = [letter + special_symbol for letter in doubled_letters]

print("Список удвоенных символов:", doubled_letters)
print("Склейка с дополнительным символом:", result_msg)