# Пользователь вводит два числа: А и В. Реализуйте код,
# который генерирует список из
# чётных чисел в диапазоне от А до B. Используйте list comprehensions
# (как и в следующих задачах).


a = int(input("Введите число А: "))
b = int(input("Ведите число: b "))
numbers = [x ** 2 for x in range(a, b) if x % 2 == 0]
print(numbers)