from flask import Flask     # <-- Импорт класса Flask.

app = Flask(__name__)   # <-- Создаем экземпляр класса.(Указываем его имя)

# Создаем представление(url-routing Маршрутизатор запроса)...
# Обработчик, который обрабатывает наш запрос пришедший от клиента.
@app.route('/')    # <-- Указываем url адрес по которому будет обрабатывать данный обработчик.
@app.route('/index')    # <-- Или записываем такой url адрес. Это будет одно и тоже.
def index():    # < endpoint (точка подключения к сервису приложения) Функция-обработчик.
    return 'index'

@app.route('/about')
def about():
    return "<h1>О сайте</h1>"

if __name__ == "__main__":  # <-- Условии запускается не посредственно на локальном компьютере.
    app.run(debug=True, port=5555)     # <-- Запуск локального веб-сервера.
    # В качестве параметра передаем значение...
    # Debug = true --> Для того что в браузере показывались все ошибки при разработке сайта. По окончании написания
    # сайта следует перевести флаг на False, это для того случайные ошибки пользователь не видел.

# -------------------------------------------------------------------------------------------------------------------- #
# Если запускать локальный сервер с терминала, то для этого надо прописать:
# cd <path> # Указываем путь к папке , где храниться исполняемый файл.
# export FLASK_APP="app.py"
# export export FLASK_DEBUG=1
# python -m flask run --port=5555 <-- port может быть любым... Кроме меньшего 1024, на них нужны права администратора.
# -------------------------------------------------------------------------------------------------------------------- #