# Задача 1. Сумма чисел
# Что нужно сделать

# Напишите функцию summa_n, которая принимает одно целое положительное число
# N и выводит сумму всех чисел от 1 до N включительно.

# Пример работы программы:
# Введите число: 5
# Я знаю, что сумма чисел от 1 до 5 равна 15

# Что оценивается
# результат вывода соответствует условию;
# input содержит корректное приглашение для ввода;
# формат вывода соответствует примеру;
# вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием).

def summ(N):
    count = 0
    for summ in range(1, N + 1):
        count += summ
    print(f"Сумма всeх чисел от 1 до {N} = {count}")

N = int(input("Введите количество чисел в последовательности: "))
summ(N)