# Задача 2. Функция в функции
# Что нужно сделать

# Евгений проходит специальный тест по программированию. У него всё шло хорошо,
# пока он не наткнулся на тему «Функции». Задание звучит так:

# Основная ветка программы, не считая заголовков функций, состоит из одной строки кода.
# Это вызов функции test(). В ней запрашивается на ввод целое число. Если оно положительное,
# то вызывается функция positive(), тело которой содержит команду вывода на экран слова «Положительное».
# Если число отрицательное, то вызывается функция negative(), её тело содержит выражение вывода
# на экран слова «Отрицательное».

# Помогите Евгению и реализуйте такую программу.
# Что оценивается
# результат вывода соответствует условию;
# input содержит корректное приглашение для ввода;
# вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием).


def test(x):
    if x > 0:
        positive(x)
    elif x < 0:
        negative(x)

def positive(x):
    print(f"Число {x} положительное.")

def negative(x):
    print(f"Число {x} отрицательное.")

x = int(input("Введите целое число: "))
test(x)

