# Задача 4. Число наоборот
# Что нужно сделать
# Вводится последовательность чисел, которая оканчивается нулём.
# Реализуйте функцию, которая принимает в качестве аргумента каждое число,
# переворачивает его и выводит на экран.

# Пример:
# Введите число: 1234
# Число наоборот: 4321
# Введите число: 1000
# Число наоборот: 0001
# Введите число: 0
# Программа завершена!

# Дополнительно: добейтесь такого вывода чисел, в начале которых идут нули.
# Введите число: 1230
# Число наоборот: 321

# Кстати, нули, которые мы убрали, называются ведущими.
# Что оценивается
# результат вывода соответствует условию;
# формат вывода соответствует примеру;
# input содержит корректное приглашение для ввода;
# вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием).

def menu():
    number = int(input("Введите число: "))
    if number != 0:
        revers(number)

def revers(number):
    digit = 0
    while number > 0:
        digit += number % 10
        number //= 10
        digit *= 10
    print(f"Число наоборот: {digit // 10}\n")
    menu()
menu()

