# Практиканту дали задание найти старую металлическую монетку по заданным координатам.
# Металлоискатель сканирует местность вокруг пользователя, и при обнаружении/отсутствии
# металла прибор отображает на экране соответствующее сообщение.

# Даны два действительных числа x и y. Напишите функцию, которая проверяет, принадлежит
# ли точка с координатами (x, y) заштрихованному квадрату (включая его границу). Если точка
# принадлежит квадрату, выведите сообщение «Монетка где-то рядом», в противном случае
# выведите сообщение «Монетки в области нет». На рисунке сетка проведена с шагом 1.

# Что оценивается
# результат вывода соответствует условию;
# input содержит корректное приглашение для ввода;
# формат вывода соответствует условию («Монетка где-то рядом», «Монетки в области нет»);
# вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием).



def in_quadr(x, y):
    if abs(x) > 1 or abs(y) > 1:
        print('\nМонетки в области нет')
    else:
        print('\nМонетка где-то рядом')

x = float(input('Введите координату X: '))
y = float(input('Введите координату Y: '))

in_quadr(x, y)