# Задача 7. Опять?
# Что нужно сделать

# Вы снова встретились со своим старым другом, который был безмерно благодарен вам за то,
# что вы помогли ему сдать задачу тому преподавателю. Вот только друг всё равно выглядел
# довольно грустным. Когда вы спросили, в чём дело, друг взорвался эмоциями и рассказал,
# что теперь препод попросил написать функцию нахождения минимального числа без использования
# условного оператора и циклов. Конечно же, вы решили снова помочь бедняге. Напишите для него
# такую программу.

def min(number1, number2):
    return (number1 + number2 - abs(number1 - number2)) / 2


num1 = float(input('Введите первое число: '))
num2 = float(input('Введите второе число: '))

print('\nНаименьшее число: ', round(min(num1, num2), 5))