# Дана строка, в которой хранятся первые семь букв английского алфавита.

# alphabet = 'abcdefg'
# Напишите программу, которая выводит на экран десять вот таких результатов:

# Копию строки.
# Элементы строки в обратном порядке.
# Каждый второй элемент строки (включая самый первый).
# Каждый второй элемент строки после первого.
# Все элементы до второго.
# Все элементы начиная с конца до предпоследнего.
# Все элементы в диапазоне индексов от 3 до 4 (не включая 4).
# Последние три элемента строки.
# Все элементы в диапазоне индексов от 3 до 4.
# То же, что и в предыдущем пункте, но в обратном порядке.

alphabet = 'abcdefg'
copy_alphabet = alphabet[:]
print(f"Копия строки: {copy_alphabet}")
print(f"Элементы строки в обратном порядке: {alphabet[::-1]}")
print(f"Каждый второй элемент строки (включая самый первый) {alphabet[::2]}")
print(f"Каждый второй элемент строки после первого: {alphabet[1::2]}")
print(f"Все элементы до второго: {alphabet[:1]}")
print(f"Все элементы начиная с конца до предпоследнего: {alphabet[:-2:-1]}")
print(f"Все элементы в диапазоне индексов от 3 до 4 (не включая 4): {alphabet[3]}")
print(f"Последние три элемента строки: {alphabet[-3::1]}")
print(f"Все элементы в диапазоне индексов от 3 до 4: {alphabet[3:5:]}")
print(f"То же, что и в предыдущем пункте, но в обратном порядке: {alphabet[4:2:-1]}")
