# Задача 3. Контроль
# В любой компании есть список сотрудников. Руководство одной компании хочет знать,
# на рабочем месте ли сейчас сотрудник. У каждого сотрудника есть пропуск со своим ID-номером
# (это положительное число), список активных пропусков сотрудников известен заранее.
#
# Напишите программу, которая сначала запрашивает у пользователя количество сотрудников в офисе,
# ID их пропусков, а затем запрашивает ID пропуска, который нужно найти в этом списке. Если такой
# есть, то вывести «Сотрудник на месте», а иначе «Сотрудник не работает!».

# Пример:
# Кол-во сотрудников в офисе: 4
# ID сотрудника: 10
# ID сотрудника: 20
# ID сотрудника: 30
# ID сотрудника: 40
# Какой ID ищем? 35
# Сотрудник не работает!

count_of_workers = int(input("Кол-во сотрудников в офисе: "))
workers_id = []
for _ in range(count_of_workers):
    worker_id = int(input("ID сотрудника: "))
    workers_id.append(worker_id)

search_id = int(input("Какого сотрудника ищем? "))

if search_id in workers_id:  # Благодаря оператору in поиск можно упростить
    print("Сотрудник работает!")
else:
    print("Сотрудник не работает!")