# Напишите программу, которая имитировала бы часы с кукушкой. В начале работы она
# спрашивает, который час, а затем нужное количество  раз пишет “Ку-ку!”.
clock = int(input("Который час? : "))
for i in range(clock):
    print("Ку-Ку!")