"""Что нужно сделать.
Есть файл people.txt, в котором построчно хранится N имён пользователей.

Напишите программу, которая берёт количество символов в каждой строке файла и в качестве ответа выводит общую сумму.
Если в какой-либо строке меньше трёх символов (не считая литерала \n), то вызывается ошибка и сообщение, в какой именно
строке она возникла. Программа при этом не завершается и обрабатывает все имена файла.

Также при желании можно вывести все ошибки в отдельный файл errors.log.

Пример работы программы
Содержимое файла people.txt:
Василий
Николай
Надежда
Никита
Ян
Ольга
Евгения
Кристина

Ответ в консоли:
Ошибка: менее трёх символов в строке 5.
Общее количество символов: 49."""

print('Решение № 1')
sym_sum = 0
count_line = 0
list_error = []
with (open('people.txt', 'r', encoding='utf-8') as people_file): # Открываем файл.
    for i_line in people_file: # Перебираем строки в файл выгрузки.
        try:
            count_line += 1 # Считаем кол-во строк в файле.
            length = len(i_line)  # Считаем кол-во знаков в строке.
            if i_line.endswith('\n'): # Если строка заканчивается сна перенос текста на новую строку...
                length -= 1 # ... Отнимаем этот знак из подсчета.

            sym_sum += length

            if length < 3:
                raise UserWarning

        except UserWarning:
            list_error.append(count_line)


print(f'Ошибка: менее трёх символов в строке {list_error}')
print(f'Общие количество символов: {sym_sum}')
