print("Урок 5.2 - Практика ")
# print("Пример № 1")
# bank = int(input("Что-бы купить курс, скажите сколько денег на счету:"))
# if bank >= 75000:
#     bank -= 75000
#     print("Курс успешно приобретен.")
#     if bank < 5000:
#         bank += 1000
#         print("Сделана скидка")
# else:
#     print("Курс не сможем купить!")
# print("Остаток на счету: ",bank, "рублей")
# print("Хорошего дня.")

# print("Пример № 2")
# product = int(input("Введи сумму чека: "))
# delivery = int(input("Введи сумму доставки: "))
# discount = 0
# if product > 10000:
#     print("Чек больше 10000 рублей! Снижаем доставку вдвое.")
#     delivery /= 2
#     if product % 2 == 0:
#         print("Покупателю положен подарок.")
#         discount -= 500
# price = product + delivery + discount
# print("Полная стоимость товаров:", price)

print("Урок 5.3 - Цепочки условий if-elif-else")
# profit = int(input("Какой доход,говори?)"))
# if profit < 10000:
#     tax = profit * 13 / 100
#     print("Размер налога равен в 13% равен:",tax)
# elif profit < 50000:
#     tax = profit * 20 / 100
#     print("Размер налога равен в 20% равен:",tax)
# else:
#     tax = profit * 30 / 100
#     print("Размер налога равен в 30% равен:", tax)
# print("----------------------------------------------")

print("Урок 5.4 - Логические операторы and и or")
print("Решение домашки № 2 Как поступить?")
# Point = int(input("Введите результат экзамена: "))
# Medal = input("Наличие медали: ")
# if Point > 280 and Medal == "Да":
#     print("Поздравляем! Ты поступил!")
# else:
#     print("К сожаления ты не прошел в наш университет!")
