# Напишите программу, которая выводит в отдельную строчку каждый символ фразы “Python!”.
print("Урок 9.3 Цикл For Итерирование по  строке.")
phrase = input("Введите фразу: ")
for symbol in phrase:
    print(symbol * 5)
    print("=" * 10)