# У Никиты дома есть много компьютеров, которые он хочет подключить к одной локальной сети.
# Для этого ему нужно сгенерировать айпи адрес для каждого компьютера. Айпи адрес записывается
# как 4 числа, которые отделяются точкой. Не долго думая, для генерации Никита решил использовать
# арифметическую прогрессию, причём первые 3 числа в адресе - это члены прогрессии, а последнее
# число - это её сумма.

# Напишите программу, где пользователь вводит первый член прогрессии и разность и в результате
# получает айпи-адрес.

num_1 = int(input("Введите первый элемент:"))
raz = int(input("Введите разность: "))
num_4 = 0
print(num_1, end = ".")
for i in range(1,3):
    num_1 += raz
    print(num_1, end=".")
    num_4 += num_1
