# Задача 1. Доска
# Используя новые знания с циклами и оператором end, выведете на экран “доску”,
# которую вы делали в первом модуле
print("-" * 10)
for i in range(4):
    print("|","0"  * 8,"|")
print("-" * 10)