# На вход программе поступает целое число num. Напишите программу создания словаря,
# который включает в себя ключи от 1 до num, а значениями соответствующего ключа
# будет значение ключа в квадрате.

# Пример:
# Введите целое число: 5

# Результат: {1: 1, 2: 4, 3: 9, 4: 16, 5: 25}

# Решение SkillBox
number = int(input("Введите целое число: "))
result = {}
for digit in range(1, number + 1):
    result[digit] = digit ** 2
print("Результат:", result)

# Решение Гоша Дударь
number = int(input("Введите целое число: "))
result = {a : a ** 2 for a in range(1, number + 1)}
print(f"Результат {result}")