# ------------------------------------------------------------------------
# Ключи уникальные, т. е. они не повторяются.
# 01 - Списки и словари НЕ МОГУТ быть ключами, зато могут быть значениями.
# например: {"a":[1,2,3], "b":{"b":10 "d":20}}
# ------------------------------------------------------------------------
# Дополнения....
# example = dict()   # <--- Так создаеться словарь.
# example["Ваня"] = 1000 # <--- Так заносятся "ключ"(Ваня)со значением 1000 в словарь.


f" Задача 01 - Телефонный справочник."
# Новая переменная телефонный словарь.
phonebook_dictionary = {                                                    # <--- Словарь в круглых скобках.
    "Ваня": 88006663636,                                                     # <--- В кавычках - это ключ ,затем м записывается двоеточие .
    "Петя": 88005553535,                                                     # <--- Номер телефона - это значение присвоенное ключу.
    "Лена": 88007773737}                                                    # <--- Двух одинаковых ключей не может быть!!!!

name = input("Введите имя: ")                                             # <--- Запрашиваем имя пользователя.

if name in phonebook_dictionary:                                           # <--- Поиск имени в телефонном справочнике.
    print(f"Номер телефона: {phonebook_dictionary[name]}")     # <--- Выводим номер телефона запрашиваемого имени.
else:
    print(f"Человек с именем {name} не найден!")                   # <--- Выводим сообщение если "ключ" не найден

f" Задача 02 - Cтудент."
# Входные данные:
# Информаци о студенте.

# Пример ввода:
# Илья Иванов Москва МГУ 5 4 4 4 5
# Выходные данные:
# Словарь

student_str = input(
    "Введите информацию о студенте через пробел: \n"
    "(Имя, Фамилию, город, место учебы, оценки)\n: ")

# Создаем новую переменную и воспользуемся методом split.
student_info = student_str.split()
print(student_info)
# Создаем новый словарь.
student = dict()
# Добавляем (данные) в словарь...
student["Имя"] = student_info[0]
student["Фамилия"] = student_info[1]
student["Город"] = student_info[2]
student["Место учебы"] = student_info[3]

student["Оценки"] = []
for i_grade in student_info[4:]:
    student["Оценки"].append(int(i_grade))

for i_info in student:
    print(i_info, "-", student[i_info])

