# Напишите программу, которая считает количество знаков пунктуации в символьной строке.
# К знакам пунктуации относятся символы из набора ".,;:!?". Набор должен храниться в виде множества.

# Пример:
# Введите строку: Я! Есть. Грут?! Я, Грут и Есть.
# Количество знаков пунктуации: 6

text = input("Введите строку: ")
punctuation = set(".,;:!?")
count = 0
for sym in text:
    if sym in punctuation:
        count += 1
print(f"Количество знаков пунктуации: {count}")