# Что нужно сделать
#
# При регистрации на сайте помимо логина нужно ещё придумать надёжный пароль.
# Этот пароль должен состоять минимум из восьми символов, в нём должны быть
# хотя бы одна большая буква и хотя бы три цифры. Тогда он будет считаться надёжным.

# Напишите программу, которая запрашивает у пользователя пароль до тех пор,
# пока он не введёт надёжный пароль. Используется латиница.

# Пример:
# Придумайте пароль: qwerty
# Пароль ненадёжный. Попробуйте ещё раз.
# Придумайте пароль: qwerty12
# Пароль ненадёжный. Попробуйте ещё раз.
# Придумайте пароль: qwerty123
# Пароль ненадёжный. Попробуйте ещё раз.
# Придумайте пароль: qWErty123
# Это надёжный пароль!


while True:
    password = input("Придумайте пароль: ")
    count_word = len([i for i in password])
    count_upper = len([i for i in password if i.isupper()])
    count_digit = len([i for i in password if i.isdigit()])
    if count_word >= 8 and count_upper > 1 and count_digit >= 3:
        print("Это надежный пароль!")
        break
    else:
        print("Пароль ненадёжный. Попробуйте ещё раз.")
