# Что нужно сделать
# Пользователь вводит строку, содержащую пробелы. Найдите в ней самое длинное слово,

# Пример 1:
# Введите строку: я есть строка
# Самое длинное слово: строка
# Длина этого слова: 6

# Пример 2:
# Введите строку: а б
# Самое длинное слово: а
# Длина этого слова: 1

# Пример 3:
# Введите строку:    б
# Самое длинное слово: б
# Длина этого слова: 1


text = input("Введите строку: ").split()

sum = max([len(sum) for sum in text])
big_word = [word for word in text if len(word) == sum ]
count_word = len(big_word)

print(f"Самое длиное слово: {big_word[0]}")
print(f"Длина этого слова: {sum}")
