print("Урок 3.4 - Ввод числа с клавиатуры" )
# print("Задача № 1")
# X = int(input("Введите значение X = "))
# Y = int(input("Введите значение Y = "))
# print("Сумма = ", X + Y)

# print("Задача № 2")
# a = int(input("Введите первое число = "))
# b = int(input("Введите второе число = "))
# c = int(input("Введите третье число = "))
# d = int(input("Введите четвертое число = "))
# print(2*(c+5+(a*b)/(4*b))*(d-2*((a**3)/30))-10)

# print("Задача № 2")
# a = '2'
# b = '5'
# c = '3'
# num = 6 ** int(a) + (7 - int(b)) * int(c)
# print(num)

print("Урок 3.5 - Деление на целое число и с остатком" )
# apples = 41
# boxes = 3
# Full_boxes = apples / boxes # результат будет 13,66666666666
# print(Full_boxes)
# Full_boxes = apples // boxes # результат будет 13
# print("Кол-во яблок в одном ящике", Full_boxes)
# rest_apples = apples % boxes # Показывает остаток от деления
# print("После разложения осталось ", rest_apples, "яблока")

print("Урок 3.6 -Сокращенные операторы ")
# product = 0
# product +=  100
# print("Новая сумма = ", product)

print("--------------------------------------")
print("3.7 ПРАКТИЧЕСКАЯ РАБОТА")
print("-------------------------------------")
# print("Решение задачи № 1")
# a = 8
# b = 10
# c = 12
# d = 18
# res = ((-3 + a**2)*b-2**3)/c-2*d
# print(res)
# print("--------------------------------")

# print("Решение задачи № 2")
# kv1 = int(input("Доход за первый квартал = "))
# kv2 = int(input("Доход за второй квартал = "))
# kv3 = int(input("Доход за третий квартал = "))
# kv4 = int(input("Доход за четвертый квартал = "))
# res = (kv1 + kv2)/(kv3 + kv4)
# print(res)
# print("--------------------------------")

# print("Решение задачи № 3")
# x = int(input("Введите число = "))
# print("После числа",x ,"идет число", x + 1)
# print("До числа",x ,"идет число", x - 1)
# print("--------------------------------")

# print("Решение задачи № 4")
# a = int(input("Введите длину катета а:"))
# b = int(input("Введите длину катета b:"))
# s = ((a + b)/2)
# print("Площадь треугольника =", s)
# print("--------------------------------")

# print("Решение задачи № 5")
# minutes = int(input("Введите кол-во минут:"))
# day = minutes // (60*24)
# hour = (minutes -day*24*60) // 60
# ost = minutes % 60
# print(f"{minutes} это {day} дней,{hour} часов, {ost} минут.")
# print("--------------------------------")

# print("Решение задачи № 6")
# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# print("Сумма двух последних чисел равна:", a % 100 + b % 100)
# print("-----------------------------")

# print("Решение задачи № 7 <--- не решена!!! Смотреть телегу")
# l = 115
# v = int(input("Введите скорость: "))
# t = int(input("Введите время: "))
# n = 0
# ost_1 = v*t
# n += ost_1
# print(n)
# n += n
# print(n)
# print("-----------------------------")

# print("Решение задачи № 8")
# n = int(input("Введите четырех значное число: "))
# a = n % 10
# b = (n % 100) // 10
# c = (n % 1000) // 100
# d = (n % 10000) // 1000
# print(d,",",c,",",b,",",a)

# print("Решение задачи № 9")
# n = int(input("Введите четырех значное число: "))
# a = n % 10 *1000
# b = n % 100 *10
# c = n % 1000 // 100*10
# d = n % 10000 // 1000
# print(a)
# print(b)
# print(c)
# print(d)
# res = a + b - c + d
# print(res)
# тут еще конечно можно сократить
