# Что нужно сделать
# Два класса стоят в две отдельные шеренги. В каждом классе ученики выстроены по росту
# (по возрастанию): в одном классе от 160 см до 176 см с шагом 2, во втором классе —
# от 162 см до 180 см с шагом 3. Спустя какое-то время два класса объединяют в одну
# шеренгу и тоже выстраивают их по возрастанию.

# Напишите программу, которая генерирует списки роста для каждого в классе, затем
# объединяет их в один список и сортирует его в порядке возрастания. Выведите
# отсортированный список на экран.

# Формат вывода ответа:
# Отсортированный список учеников: [160, 162, …]

# -------------------------------------
# Решение задачи.
# Подключаем библиотеку для удаления одинаковых значений в списке.
# Работает только в отсортированном списке!!!
from itertools import groupby

# Создаем список первого класса.
class_1 = []
for height in range(160, 176, 2):
    class_1.append(height)

# Создаем список второго класса.
class_2 = []
for height in range(162, 180, 3):
    class_2.append(height)

# Добавляем к первому списку второй список.
class_1.extend(class_2)

# Сортируем список по возрастанию.
class_1.sort()

# Удаляем из списка одинаковые значения.
from itertools import groupby
new_class = [el for el, _ in groupby(class_1)]
print(f"Отсортированный список учеников: {new_class}")

