# Даны два списка целых чисел, оба списка заполняются с клавиатуры.
# В первый список вводится три числа, во второй — семь чисел. Напишите программу,
# которая запрашивает у пользователя эти числа, затем расширяет первый список
# элементами второго и после этого оставляет в первом списке только уникальные элементы,
# то есть удаляет лишние повторы чисел. Условный оператор использовать нельзя.

# Пример:
# Введите 1-е число для первого списка: 1
# Введите 2-е число для первого списка: 2
# Введите 3-е число для первого списка: 3
# Введите 1-е число для второго списка: 2
# Введите 2-е число для второго списка: 4
# Введите 3-е число для второго списка: 6
# Введите 4-е число для второго списка: 3
# Введите 5-е число для второго списка: 3
# Введите 6-е число для второго списка: 2
# Введите 7-е число для второго списка: 1

# Первый список: [1, 2, 3]
# Второй список: [2, 4, 6, 3, 3, 2, 1]

# Новый первый список с уникальными элементами: [4, 6, 3, 2, 1]

list_1 = []
for number in range(3):
    print(f"Введите {number + 1}-е число для первого списка: ", end="")
    digit = int(input())
    list_1.append(digit)

list_2 = []
for number in range(7):
    print(f"Введите {number + 1}-е число для первого списка: ", end="")
    digit = int(input())
    list_2.append(digit)

print(f"Первый список: {list_1}")
print(f"Второй список: {list_2}")

list_1.extend(list_2)
list_1.sort()
print(list_1,"\n")

new_list = []
for i in list_1:
    if i not in new_list:
        new_list.append(i)

print(f"Новый первый список с уникальными элементами: {new_list}")