print("Задача № 3. Посчитай чужую зарплату....")
# Бухгалтер устала постоянно считать вручную среднегодовую зарплату сотрудников компании и,
# чтобы облегчить себе жизнь, обратилась к программисту.
# Напишите программу, которая принимает от пользователя зарплату сотрудника за каждый из 12 месяцев и выводит на
# экран среднюю зарплату за год.
summ = 0
for month in range(12):
    cash = int(input("Эвведите зарплату сотрудника за месяц: "))
    summ += cash
print("Средняя зарплата сотрудника составляеn: ", summ/month)
