print("Задача № 4. С заботой о природе...")
# Огромный заповедник поделён на большое количество секторов. Все сектора пронумерованы.
# Вы устроились на работу лесничим и отвечаете за группу секторов с номерами 30–35.
# В ваши обязанности входит:
# следить за тем, чтобы посетителей в каждом секторе было не больше десяти;
# фиксировать количество нарушений этого правила.
# Напишите программу, которая для каждого сектора запрашивает текущее количество людей в нём,
# и если оно больше десяти, то фиксирует нарушение. В конце выведите количество нарушений.
violation = 0
for sector in range(30, 36):
    people = int(input("Людей в " + str(sector) + "-м секторе: " ))
    if people > 10:
        print("Нарушение! Слишком много людей в секторе!")
        violation += 1
    else:
        print("Все спокойно.")
print("Количество нарушений: ", violation)