# Задача 5. Факториал
# Что нужно сделать
#
# Мы всё ближе и ближе подбираемся к серьёзной математике. Одна из классических задач — задача
# на нахождение факториала числа. И в будущем мы с ней ещё встретимся.

# Дано натуральное число n. Напишите программу, которая находит n! (n-факториал).
# Запись n! означает следующее:
# n! = 1 * 2 * 3 * 4 * 5 * … * n

print("Задача № 5. Факториал")
n = int(input("Введите число: "))
total_factorial = 0
for factorial in range(1, n+1):
    factorial = factorial * (factorial * n)
print("Факториал числа ", factorial, "равен", total_factorial)