print("Задача № 6. Успеваемость в классе")
# В классе N человек. Каждый из них получил за урок по информатике оценку: 3, 4 или 5,
# двоек сегодня не было. Напишите программу, которая получает список оценок — N чисел — и выводит на экран
# сообщение о том, кого сегодня больше: отличников, хорошистов или троечников.
# Замечание: можно предположить, что количество отличников, хорошистов, троечников различно.

n = int(input("Введите кол-во учеников в классе: "))
num_5 = 0
num_4 = 0
num_3 = 0
for amount in range(1, n+1):
    grade = int(input("Какую отметку получил " + str(amount) + " ученик: "))
    if grade == 5:
        num_5 += 1
    if grade == 4:
        num_4 += 1
    if grade == 3:
        num_3 += 1
if num_5 > num_4 and num_5 > num_3:
    print("Сегодня больше отличников")
if num_4 > num_5 and num_4 > num_3:
    print("Сегодня больше хорошистов")
if num_3 > num_4 and num_3 > num_5:
    print("Сегодня много троечников")