# Напишите программу, которая считывает с клавиатуры два числа a и b, считает и выводит
# на консоль среднее арифметическое всех чисел из отрезка [a; b], кратных числу 3

a = int(input("Введите начальное значение отрезка: "))
b = int(input("Введите конечное значение отрезка: "))
summ = 0
sum_line = 0
for line in range(a, b):
    if line % 3 == 0:
        summ += line
        sum_line += 1
print("Cреднее арифметическое всех чисел из отрезка [",a,":" ,b, "]  кратных числу 3 равно:", summ / sum_line)