# Задача 8. Замечательные числа
# Что нужно сделать

# Напишите программу, которая находит и выводит все двузначные числа, которые
# равны утроенному произведению своих цифр. К таким относятся, например, 15 и 24.

# Что оценивается
# Задание считается успешно выполненным, если:
# результат вывода соответствует условию;
# допускается вывод без описания, достаточно вывести числа;
# переменные имеют значащие имена, не только a, b, c, d.

for number in range (10,99):
    a = number // 10
    b = number % 10
    x = a * b * 3
    if number == x:
        print(number, end= ",")
