# Задача 9. ...Теперь можно посчитать и свою
# Что нужно сделать

# Пока бухгалтер считала среднюю зарплату сотрудников, ей стало интересно,
# а не зря ли она работает столько времени на одном месте? Ей захотелось узнать,
# увеличивается ли её зарплата с каждым месяцем или нет.

# Пользователь вводит десять чисел. Напишите программу, которая проверяет, упорядочены ли они по возрастанию.

# Что оценивается
# Задание считается успешно выполненным, если:
# результат вывода соответствует условию;
# input содержат корректные приглашения для ввода;
# в выводе есть один окончательный ответ, который отвечает на поставленный вопрос о возрастании зарплаты;
# переменные имеют значащие имена, не только a, b, c, d
number_1 = 0
for i in range (10):
    number_2 = int(input("Введите зарплату: "))
    if number_2 > number_1:
        number_1 = number_2
    else:
        print("Зарплата не возрастает.")
        break
print("Зарплата возрастает каждый месяц")