# Задача 10. Пропавшая карточка
# Что нужно сделать

# Для настольной игры используются карточки с номерами от 1 до N.
# Одна карточка потерялась. Напишите программу, которая поможет найти потерянную карточку,
# если номера оставшихся известны. Найдите её, зная номера оставшихся карточек.

# Введите число карточек — N.
# Затем введите N - 1 номера оставшихся карточек. Они могут быть введены в любом порядке.

# Пример:
# Введите количество карточек: 5
# Введите номер оставшейся карточки: 1
# Введите номер оставшейся карточки: 4
# Введите номер оставшейся карточки: 5
# Введите номер оставшейся карточки: 3
# Номер пропавшей карточки: 2

# Что оценивается
# Задание считается успешно выполненным, если:
# результат вывода соответствует условию;
# input содержат корректные приглашения для ввода;
# переменные имеют значащие имена, не только a, b, c, d.

summ = 0
card = int(input("Введите кол-во карточек: "))

for number in range(0, card + 1):
    summ += number

for number_x in range(card - 1):
    number_card = int(input("Введите номер оставшийся карточки: "))
    summ -= number_card
print("Номер оставшийся карточки:", summ)
