# Задача 3. Следим за зубами
# Что нужно сделать
# Стоматолог посоветовал Маше использовать зубную нить каждый чётный день. Чтобы не забывать,
# Маша написала скрипт на Python, который в случае чего напоминает ей о совете стоматолога.
# Напишите программу, которая проверяет, чётное ли число ввёл пользователь, и выводит соответствующее сообщение.
# Подсказка: для проверки чётности используйте оператор %.
# Что оценивается
# input содержит корректное приглашение для ввода;
# результат вывода корректен;
# переменные имеют значащие имена, не только a, b, c, d (видео 2.3);
# правильное употребление пробелов после запятых и при бинарных операциях.
number = int(input("Введите число: "))
if number % 2 != 0:
    print(f"Число {number} нечетное.")
else:
    print(f"Число {number} четное.")