# Задача 4. Калькулятор скидки
# Что нужно сделать
# Андрей переехал в новую квартиру, и ему нужно купить три стула в разные комнаты. Естественно,
# цена на стулья в разных магазинах различается, а где-то ещё и скидка есть. Вот для одного из таких
# магазинов он и написал калькулятор скидки, чтобы проще ориентироваться в ценах.

# Напишите программу, которая запрашивает три стоимости товара и вычисляет сумму чека. Если сумма
# чека превышает 10 000 рублей, нужно вычесть из этой суммы скидку 10% (умножить на 10, разделить на
# 100). В конце вывести итоговую сумму на экран.

# Что оценивается
# корректность вычислений и применения правильных операций;
# input содержит корректное приглашение для ввода;
# переменные имеют значащие имена, не только a, b, c, d (видео 2.3);
# правильное употребление пробелов после запятых и при бинарных операциях.

price_1 = int(input("Стоимость первого товара: "))
price_2 = int(input("Стоимость второго товара: "))
price_3 = int(input("Стоимость третьего товара: "))
total = price_3 + price_2 + price_1
if total > 10000:
    total -= total * 10 / 100
print(f"Стоимость товара составляет {total}")