# Задача 7. Банкомат
# Что нужно сделать
# Пользователи банкомата хотят снимать деньги. Но банкомат выдаёт только купюры по 100 рублей.
# Напишите программу, которая проверяет допустимость денежной суммы, которую ввёл пользователь.
# Пример:
# Введите сумму, которую хотите снять: 250
# Такую сумму снять невозможно. Обратитесь в другой банкомат.
# Что оценивается
# input содержит корректное приглашение для ввода;
# формат вывода соответствует примеру (не выведено одно число без описания);
# переменные имеют значащие имена, не только a, b, c, d (видео 2.3);
# правильное употребление пробелов после запятых и при бинарных операциях.
money = int(input("Введите сумму для снятия: "))
if money % 100 != 0:
    print("Такую сумму снять невозможно. Обратитесь в другой банкомат.")