# Задача 8. Хватит ли зарплаты
# Что нужно сделать
#
# Георгий работает неофициально по часам, и его зарплата высчитывается по следующей формуле:
# (200 * hours) / 2 ** 3 + hours
#
# Он хочет понять, сколько часов нужно отработать, чтобы хватило на погашение кредита и еду.
#
# Напишите программу, которая запрашивает у пользователя три числа: количество отработанных часов, остаток
# по кредиту и количество денег на еду. После этого рассчитывается зарплата по формуле, и если зарплата больше
# либо равна денежной сумме, которая требуется на кредит и еду, то выводится сообщение: «Часов хватает. Можно
# отдохнуть», в противном случае: «Часов не хватает. Придётся работать!».

# Пример:
# Введите отработанные часы: 80
# Введите остаток по кредиту: 1000
# Введите траты на еду: 5000
# Часов не хватает. Придётся работать!

# Что оценивается
# результат вычислений корректен;
# input содержит корректное приглашение для ввода;
# формат вывода соответствует примеру (не выведено одно число без описания);
# переменные имеют значащие имена, не только a, b, c, d (видео 2.3);
# пробелы после запятых, пробелы при бинарных операциях.

hours = int(input("Количество отработанных часов: "))
kredit = int(input("Остаток по кредиту: "))
food = int(input("Количество денег на еду: "))
zp = (200 * hours) / 2 ** 3 + hours
if zp > kredit + food:
    print("Часов хватает. Можно отдохнуть.")
else:
    print("Часов не хватает. Придётся работать!")