# Задача 10. Максимальное число (по желанию)
# Что нужно сделать
# Пользователь вводит три числа.
# Напишите программу, которая выводит на экран максимальное из этих трёх чисел (все числа разные). Используйте дополнительные переменные, если нужно.

# Что оценивается
# результат вычислений корректен;
# input содержит корректное приглашение для ввода;
# правильное употребление пробелов после запятых и при бинарных операциях.

number_1 = int(input("Введите первое число: "))
number_2 = int(input("Введите второе число: "))
number_3 = int(input("Введите третье число: "))
if number_2 < number_1 > number_3:
    print("Наибольшее число: ", number_1)
if number_1 < number_2 > number_3:
    print("Наибольшее число: ", number_2)
if number_1 < number_3 > number_2:
    print("Наибольшее число: ", number_3)