# Что нужно сделать
# Для соревнований по волейболу необходимо сформировать турнирнирную сетку из восьми человек
# на два дня. На первый день из списка участников решили выбрать каждого второго.

# Дан список из восьми имён: Артемий, Борис, Влад, Гоша, Дима, Евгений, Женя, Захар.
# Напишите программу, которая выводит элементы списка только с чётными индексами.

# Пример:
# Первый день: ['Артемий', 'Влад', 'Дима', 'Женя']

name = ["Артемий", "Борис", "Влад", "Гоша", "Дима", "Евгений", "Женя", "Захар"]
index = len(name)
day_1 = []

for i in range(index):
    if i % 2 == 0:
        day_1.append(name[i])
print(f"Первый день: {day_1}")

