# В научной лаборатории выводят и тестируют новые виды клеток.
# Есть список из N этих клеток, элементом которого является показатель эффективности,
# а индексом — ранг клетки. Учёные отбирают клетки по следующему принципу:
# если эффективность клетки меньше её ранга, то она не подходит.

# Напишите программу, которая выводит на экран элементы списка,
# значения которых меньше их индекса.

# Пример:
# Количество клеток: 5
# Эффективность 1 клетки: 3
# Эффективность 2 клетки: 0
# Эффективность 3 клетки: 6
# Эффективность 4 клетки: 2
# Эффективность 5 клетки: 10

# Неподходящие значения: 0 2
list_N = []
for i in range(int(input("Количество клеток: "))):
    print(f"Эффективность {i + 1} клетки: ", end="")
    effect = int(input())
    if i + 1 > effect:
        list_N.append(effect)
print(f"\nНеподходящие значение: {list_N}")
