# Что нужно сделать
# В базе магазина электроники есть список видеокарт компании NVIDIA разных поколений.
# Вместо полных названий хранятся только числа, которые обозначают модель и поколение
# видеокарты. Недавно компания выпустила новую линейку видеокарт. Самые старшие
# поколения разобрали за пару дней.

# Напишите программу, которая удаляет из списка видеокарт наибольшие элементы.

# Пример:
# Количество видеокарт: 5
# 1 Видеокарта: 3070
# 2 Видеокарта: 2060
# 3 Видеокарта: 3090
# 4 Видеокарта: 3070
# 5 Видеокарта: 3090

# Старый список видеокарт: [ 3070 2060 3090 3070 3090 ]
# Новый список видеокарт: [ 3070 2060 3070 ]

list_number = []
max_number = 0

for i in range(int(input("Количество видеокарт: "))):
    print(f"{i + 1} Видеокарта: ", end="")
    number = int(input())
    list_number.append(number)
    if max_number < number:
        max_number = number
print(f"\nCтарый список видеокарт: {list_number}")

new_list = []
for i in list_number:
    if i != max_number:
        new_list.append(i)
print(f"Новый список видеокарт: {new_list}")

