# Что нужно сделать
# Илья зашёл на любительский киносайт, на котором пользователи оставляют рецензии на фильмы.
# Их список:

# films = ["Крепкий орешек", "Назад в будущее", "Таксист", "Леон", "Богемская рапсодия",
# "Город грехов", "Мементо", "Отступники", "Деревня"]
#
# Илья на сайте в первый раз. Он хочет зарегистрироваться и сразу добавить часть фильмов
# в список любимых, чтобы позже прочитать рецензии на них.
#
# Напишите программу, в которой пользователь вводит фильм. Если он есть в перечне,
# то добавляется в список любимых. Если его нет, то выводится ошибка. В конце выведите
# весь список любимых фильмов.

# Пример:
# Сколько фильмов хотите добавить? 3
# Введите название фильма: Леон
# Введите название фильма: Безумный Макс
# Ошибка: фильма Безумный Макс у нас нет :(
# Введите название фильма: Мементо
# Ваш список любимых фильмов: Леон, Мементо

films = ["Крепкий орешек", "Назад в будущее", "Таксист", "Леон", "Богемская рапсодия",
         "Город грехов", "Мементо", "Отступники", "Деревня"]

like_films = []
count_films = len(films)

for _ in range(int(input("Сколько фильмов хотите добавить: "))):
    print(f"Введите название фильма: ", end="")
    introduced_films = (input())
    count = 0
    for search in films:
        count += 1
        if search == introduced_films:
            like_films.append(search)
            count = 0
            break
        elif count == count_films and search != introduced_films:
            print(f"Ошибка: Фильма {introduced_films} у нас нет.")
print(f"Ваш список любимых фильмов: {like_films}")
