# Что нужно сделать
# Напишите программу — анализатор слов, чтобы использовать
# её для тренировки нейросети и генерировать нужный текст.

# Пользователь вводит слово. Напишите программу, которая считает количество
# уникальных букв в слове. Уникальные буквы — это те, которые встречаются всего один раз.

# Пример 1:
# Введите слово: привет
# Количество уникальных букв: 6

# Пример 2:
# Введите слово: лава
# Количество уникальных букв: 2

word = input("Введите слово: ")
new_word = list(word)
count_word = len(new_word)
count_number = 0
for i in new_word:
    count = 0
    for n in new_word:
        if i == n:
            count += 1
    if count == 1:
        count_number +=1
print(f"Количество уникальных букв: {count_number}")


