# Продолжите писать анализаторы для текста. Теперь необходимо р
# еализовать код, с помощью которого можно определять палиндромы.
# То есть нужно находить слова, которые одинаково читается слева направо и справа налево.

# Напишите такую программу.

# Пример 1:
# Введите слово: мадам
# Слово является палиндромом

# Пример 2:
# Введите слово: abccba
# Слово является палиндромом

# Пример 3:
# Введите слово: abbd
# Слово не является палиндромом

word = input("Введите слово: ")
list_word = list(word)
count_word = len(list_word)
index_1 = 0
index_2 = -1
word = True
while index_1 <= count_word:
    if list_word[index_1] == list_word[index_2]:
        index_1 += 1
        index_2 -= 1
        break
    elif list_word[index_1] != list_word[index_2]:
        print("Слово не является палиндроном.")
        word = False
        break
if word:
    print("Слово является палиндромом!")