# Дан список из N чисел. Напишите программу,
# которая сортирует элементы списка по возрастанию и выводит их на экран.
# Дополнительный список нельзя использовать.

# Постарайтесь придумать и написать как можно более эффективный алгоритм сортировки.

# Пример:
# Изначальный список: [1, 4, -3, 0, 10]
# Отсортированный список: [-3, 0, 1, 4, 10]

def plus(a, b):
    return a + b

if __name__ == "__main__":
    print(plus(2, 2))

print("Возврат к позапрошлому введению")