# При покупках за рубежом с помощью карты банки делают конвертацию через промежуточную валюту.
# Например, если купить что-то в евро, то сначала эта сумма конвертируется в доллары, а уже потом - в рубли.

# Напишите программу, которая получает на вход стоимость покупки в евро, затем выводит ответ в рублях.
# Мы живём в альтернативной реальности, где 1 евро = 1.25 доллара, а 1 доллар = 60.87 рублей.

price = float(input("Введиете стоимость покупки в EURO: "))
print(f"Cтоимоcть покупки в рублях: {round(price * 1.25 * 60.87, 2)}")