# В одном центре математического анализа работал практикант,
# который написал программу для расчёта некоторых функций.
# Правда, он в тот день очень устал и немного не так прочитал техническое задание,
# поэтому функции теперь рассчитываются довольно грубо.

# Программа работает следующим образом: вводится последовательность из N
# вещественных чисел. При этом положительные числа округляются вверх, отрицательные
# округляются вниз. Напишите программу, которая выводит натуральный логарифм от числа,
# если оно положительное, и экспоненту в степени числа, если оно отрицательное.

# Пример:
import math
for digit in range(int(input("Введите кол-во чисел: "))):
    x = float(input("Введите число: "))
    if x > 0:
        x = math.ceil(x)
        print(f"x = {x}  log(x) = {math.log(x)}")
    else:
        x = math.floor(x)
        print(f"x = {x} exp(x) =  {math.exp(x)}")
