# Задача 4. Первая цифра
# Что нужно сделать
# Дано положительное действительное число X. Выведите его первую
# цифру после десятичной точки. При решении этой задачи нельзя пользоваться
# условной инструкцией, циклом или строками.

# Что оценивается
# результат вывода соответствует условию;
# в вычислениях не используется for, if и работа со строками;
# input содержит корректное приглашение для ввода;
# вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием).

X = float(input('Введите число X: '))
X *= 10
X = int(X)
X %= 10
print('Первая цифра после десятичной точки =', X)
