# Задача 6. Метеостанция
# Что нужно сделать
#
# Сотрудники международной метеостанции должны каждый день передавать показания градусов по шкалам и Цельсия,
# и Фаренгейта. Напишите программу, которая принимает на вход три целых числа в градусах Цельсия: нижняя граница т
# емпературы, верхняя граница температуры и шаг. Программа выводит на экран таблицу соответствия градусов Цельсия
# градусам Фаренгейта от нижней до верхней границы с указанным шагом. Обеспечьте контроль ввода. Верхняя граница
# должна печататься, даже если последний шаг “перепрыгнул “ ее. Известно, что 0С соответствует 32F, а каждый градус
# Цельсия эквивалентен 1.8 градусам Фаренгейта.

# Пример:
# Ввод:
# Нижняя граница: 0
# Верхняя граница: 50
# Шаг: 20
# Вывод:
# C   F
# 0   32
# 20  68
# 40  104
# 50  122

import math
down = int(input("Нижняя граница: "))
up = int(input("Верхняя граница: "))
step = int(input("Шаг: "))
print("C\t", "F")
for row in range(down, up + step, step):
    if row > up:
        row = up
    print(row, end="\t")
    row = round(row * 1.8 + 32, 0)
    print(int(row))



