# Задача 7. Ход конём
# Что нужно сделать
#
# В рамках разработки шахматного ИИ стоит новая задача. По заданным вещественным
# координатам коня и второй точки программа должна определить может ли конь ходить
# в эту точку. Используйте как можно меньше конструкций if и логических операторов.
# Обеспечьте контроль ввода.

# Пример:
# Введите местоположение коня:
# 0.071
# 0.118
# Введите местоположение точки на доске:
# 0.213
# 0.068
# Конь в клетке (0, 1). Точка в клетке (2, 0).
# Да, конь может ходить в эту точку.

# print("Введите расположение коня от 0.1 до 0.8:")
# x1 = 0
# while x1 <= 0 or x1 > 0.8:
#     x1 = float(input("По оси x: "))
#




# y1 = float(input("По оси y: "))
#
# print("Введите местоположение точки на доске:")
# x2 = float(input("По оси x: "))
# y2 = float(input("По оси y: "))




print('\nВведите местоположение коня:')

y1 = float(input('Позиция вертикали: '))
while y1 < 0 or y1 > 0.8:
    y1 = float(input('Неверный ввод! Введите корректную позицию вертикали: '))

x1 = float(input('Позиция горизонтали: '))
while x1 < 0 or x1 > 0.8:
    x1 = float(input('Неверный ввод! Введите корректную позицию горизонтали: '))

y1 = int(y1 * 10)
x1 = int(x1 * 10)

print('\nВведите местоположение точки на доске:')

new_y1 = float(input('Позиция вертикали: '))
while new_y1 < 0 or new_y1 > 0.8:
    new_y1 = float(input('Неверный ввод! Введите корректную позицию вертикали: '))

new_x1 = float(input('Позиция горизонтали: '))
while new_x1 < 0 or new_x1 > 0.8:
    new_x1 = float(input('Неверный ввод! Введите корректную позицию горизонтали: '))

new_y1 = int(new_y1 * 10)
new_x1 = int(new_x1 * 10)

if abs(y1 - new_y1) == 2 and abs(x1 - new_x1) == 1:
    print('Конь в клетке (' + str(y1) + ', ' + str(x1) + '). Точка в клетке (' + str(new_y1) + ', ' + str(new_x1) + ').')
    print('Да, конь может ходить в эту клетку.')
elif abs(y1 - new_y1) == 1 and abs(x1 - new_x1) == 2:
    print('Конь в клетке (' + str(y1) + ', ' + str(x1) + '). Точка в клетке (' + str(
        new_y1) + ', ' + str(new_x1) + ').')
    print('Да, конь может ходить в эту клетку.')
else:
    print('Неверный ход!')