# Задача 8. Часы
# Что нужно сделать
# С начала суток часовая стрелка повернулась на угол в α градусов.
# Определите на какой угол повернулась минутная стрелка с начала последнего часа.
# Входные и выходные данные — действительные числа.

# При решении этой задачи нельзя пользоваться условными операторами и циклами.
# Что оценивается:
# результат вывода соответствует условию;
# input содержит корректное приглашение для ввода.
# Вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием).

hour = int(input("На сколько повернулась часовая стрелка на чиферблате: "))
print(f"Минутная стрелка будет находить на {hour % 6 *10} минутах.")
