# Задача 10. За что?
# Что нужно сделать
# Вы встретились со своим старым другом, который тоже изучает программирование,
# правда, в другом учебном заведении. За чашкой кофе он пожаловался вам,
# что сумасбродный препод дал им задание написать программу, которая из двух
# введённых чисел определяет наибольшее, не используя при этом условных операторов,
# циклов и встроенную функцию max. Радуясь, что на вашем курсе такого не требуют,
# вы всё-таки решаете помочь своему другу. Напишите для него эту программу.

# Пример:
# Введите первое число: 10
# Введите второе число: 5
# Наибольшее число: 10

# Что оценивается
# результат вывода соответствует условию;
# input содержит корректное приглашение для ввода;
# вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием).

# Советы и рекомендации:
# Рассмотрите разность суммы и разности чисел, сумму разности и суммы чисел.
import math
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
print(f"Наибольшее число: {int(max(a,b))}")                  # Мое решение
print('Наибольшее число: ' ,int((a + b + abs(a-b)) / 2))     # Решение института